Repository: abdulrhmanasami/DW_workspace
Catalog: lib/l10n/app_*.arb
Languages: ar, de

# rideCancelDialogTitle
source: Cancel this ride?
ar: هل تريد إلغاء الرحلة؟
de: Diese Fahrt stornieren?

# rideCancelDialogMessage
source: If you cancel now, your driver will stop heading to your pickup location.
ar: إذا ألغيت الآن، سيتوقف السائق عن التوجه إلى موقعك.
de: Wenn du jetzt stornierst, fährt der Fahrer nicht mehr zu deinem Abholort.

# rideCancelDialogKeepRideCta
source: Keep ride
ar: الاستمرار في الرحلة
de: Fahrt behalten

# rideCancelDialogConfirmCta
source: Cancel ride
ar: إلغاء الرحلة
de: Fahrt stornieren

# rideCancelSuccessSnackbar
source: Your ride has been cancelled.
ar: تم إلغاء رحلتك.
de: Deine Fahrt wurde storniert.

# rideActiveHeadlineFindingDriver
source: Finding a driver…
ar: جارٍ البحث عن سائق…
de: Fahrer wird gesucht…

# rideActiveHeadlineDriverEta
source: Driver is {minutes} min away
ar: السائق يبعد {minutes} دقيقة
de: Fahrer ist {minutes} Min. entfernt

# rideActiveHeadlineDriverOnTheWay
source: Driver on the way
ar: السائق في الطريق إليك
de: Fahrer unterwegs

# rideActiveHeadlineDriverArrived
source: Driver has arrived
ar: السائق وصل إلى موقعك
de: Fahrer ist angekommen

# rideActiveHeadlineInProgress
source: Trip in progress
ar: الرحلة جارية الآن
de: Fahrt läuft

# rideActiveHeadlinePayment
source: Completing payment
ar: جارٍ إتمام الدفع
de: Zahlung wird abgeschlossen

# rideActiveHeadlineCompleted
source: Trip completed
ar: تم إنهاء الرحلة بنجاح
de: Fahrt abgeschlossen

# rideActiveHeadlineCancelled
source: Trip cancelled
ar: تم إلغاء الرحلة
de: Fahrt storniert

# rideActiveHeadlineFailed
source: Trip failed
ar: حدث خطأ في الرحلة
de: Fahrt fehlgeschlagen

# rideActiveHeadlinePreparing
source: Preparing your trip
ar: جارٍ تجهيز رحلتك
de: Ihre Fahrt wird vorbereitet

# rideActiveGoBackCta
source: Go back
ar: العودة

# rideActiveCancelledTitle
source: Trip cancelled
ar: تم إلغاء الرحلة
de: Fahrt storniert

# rideActiveCancelledBody
source: Your trip was cancelled. You can request a new ride at any time.
ar: تم إلغاء رحلتك. يمكنك طلب رحلة جديدة في أي وقت.
de: Deine Fahrt wurde storniert. Du kannst jederzeit eine neue Fahrt anfordern.

# rideActiveFailedTitle
source: Something went wrong
ar: حدث خطأ ما
de: Etwas ist schiefgelaufen

# rideActiveFailedBody
source: We couldn't complete this trip. Please try again in a moment.
ar: تعذّر إكمال هذه الرحلة. يرجى المحاولة مرة أخرى بعد قليل.
de: Wir konnten diese Fahrt nicht abschließen. Bitte versuche es in Kürze erneut.

# rideActiveBackToHomeCta
source: Back to home
ar: الرجوع للرئيسية
de: Zur Startseite

# rideActiveRequestNewRideCta
source: Request new ride
ar: طلب رحلة جديدة
de: Neue Fahrt anfordern

# rideActiveDestinationLabel
source: To {destination}
ar: إلى {destination}
de: Nach {destination}

# rideDebugFsmTitle
source: Debug FSM Controls
ar: أدوات تصحيح FSM

# rideDebugCurrentPhase
source: Current phase: {phase}
ar: المرحلة الحالية: {phase}

# rideDebugDriverFound
source: Driver Found
ar: السائق قبل

# rideDebugDriverArrived
source: Driver Arrived
ar: السائق وصل

# rideDebugStartTrip
source: Start Trip
ar: بدء الرحلة

# rideDebugCompleteTrip
source: Complete Trip
ar: إنهاء الرحلة

# rideDebugConfirmPayment
source: Confirm Payment
ar: تأكيد الدفع

# rideStatusFindingDriver
source: Looking for a driver...
ar: جاري البحث عن سائق...
de: Suche nach Fahrer...

# rideStatusDriverAccepted
source: Driver on the way
ar: السائق في الطريق
de: Fahrer unterwegs

# rideStatusDriverArrived
source: Driver has arrived
ar: السائق وصل
de: Fahrer ist angekommen

# rideStatusInProgress
source: Trip in progress
ar: الرحلة قيد التنفيذ
de: Fahrt läuft

# rideStatusPaymentPending
source: Waiting for payment
ar: في انتظار الدفع
de: Warten auf Zahlung

# rideStatusCompleted
source: Trip completed
ar: تم إنهاء الرحلة
de: Fahrt abgeschlossen

# rideStatusUnknown
source: Preparing your trip...
ar: جاري تجهيز رحلتك...
de: Fahrt wird vorbereitet...

# homeActiveRideViewTripCta
source: View trip
ar: عرض الرحلة
de: Fahrt ansehen

# homeActiveRideTitleGeneric
source: Active ride
ar: رحلة نشطة
de: Aktive Fahrt

# homeActiveRideSubtitleToDestination
source: To {destination}
ar: إلى {destination}
de: Nach {destination}

# rideDestinationTitle
source: Where to?
ar: إلى أين؟

# rideDestinationPickupLabel
source: Pick-up
ar: نقطة الالتقاط

# rideDestinationPickupCurrentLocation
source: Current location
ar: الموقع الحالي

# rideDestinationRecentLocationsSection
source: Recent locations
ar: المواقع الأخيرة

# rideLocationPickerTitle
source: Choose your trip
ar: اختيار موقع الرحلة
de: Fahrtziel wählen

# rideLocationPickerPickupLabel
source: Pickup
ar: مكان الانطلاق
de: Abholort

# rideLocationPickerDestinationLabel
source: Destination
ar: وجهة الوصول
de: Ziel

# rideLocationPickerPickupPlaceholder
source: Where should we pick you up?
ar: من أين نلتقطك؟
de: Wo sollen wir dich abholen?

# rideLocationPickerDestinationPlaceholder
source: Where are you going?
ar: إلى أين تتجه؟
de: Wohin möchtest du fahren?

# rideLocationPickerMapHint
source: Adjust the pin or use search to set your locations.
ar: حرّك العلامة أو استخدم البحث لتحديد المواقع.
de: Verschiebe die Markierung oder nutze die Suche, um Orte festzulegen.

# rideLocationPickerContinueCta
source: See prices
ar: عرض الأسعار
de: Preise anzeigen

# rideTripConfirmationTitle
source: Confirm your trip
ar: تأكيد الرحلة

# rideTripConfirmationRequestRideCta
source: Request ride
ar: طلب الرحلة

# rideTripConfirmationPaymentSectionTitle
source: Payment
ar: الدفع

# rideTripConfirmationPaymentMethodCash
source: Cash
ar: نقدًا

# rideTripSummaryTitle
source: Trip summary
ar: ملخص الرحلة

# rideTripSummaryCompletedTitle
source: Trip completed
ar: تم إنهاء الرحلة

# rideTripSummaryCompletedSubtitle
source: Thanks for riding with Delivery Ways
ar: شكرًا لاستخدامك Delivery Ways

# rideTripSummaryRouteSectionTitle
source: Route
ar: المسار

# rideTripSummaryFareSectionTitle
source: Fare
ar: الأجرة

# rideTripSummaryTotalLabel
source: Total
ar: الإجمالي

# rideTripSummaryDriverSectionTitle
source: Your driver
ar: السائق

# rideTripSummaryRatingLabel
source: Rate your driver
ar: قيّم السائق

# rideTripSummaryDoneCta
source: Done
ar: إنهاء

# rideConfirmLoadingTitle
source: Fetching ride options...
ar: جاري جلب خيارات الرحلة...
de: Fahrtoptionen werden geladen...

# rideConfirmLoadingSubtitle
source: Please wait while we find the best rides for you.
ar: يرجى الانتظار بينما نبحث عن أفضل الخيارات لك.
de: Bitte warte, während wir die besten Fahrten für dich finden.

# rideConfirmErrorTitle
source: We couldn't load ride options
ar: تعذر تحميل خيارات الرحلة
de: Fahrtoptionen konnten nicht geladen werden

# rideConfirmErrorSubtitle
source: Please check your connection and try again.
ar: يرجى التحقق من الاتصال بالإنترنت ثم المحاولة مرة أخرى.
de: Bitte überprüfe deine Verbindung und versuche es erneut.

# rideConfirmEmptyTitle
source: No rides available
ar: لا توجد رحلات متاحة
de: Keine Fahrten verfügbar

# rideConfirmEmptySubtitle
source: Please try again in a few minutes.
ar: يرجى المحاولة مرة أخرى بعد قليل.
de: Bitte versuche es in ein paar Minuten erneut.

# rideConfirmRetryCta
source: Retry
ar: إعادة المحاولة
de: Erneut versuchen

# rideConfirmRecommendedBadge
source: Recommended
ar: موصى به
de: Empfohlen

# rideConfirmFromLabel
source: From
ar: من
de: Von

# rideConfirmToLabel
source: To
ar: إلى
de: Nach

# onboardingWelcomeTitle
source: Welcome to Delivery Ways
ar: مرحبًا في Delivery Ways

# onboardingWelcomeSubtitle
source: All your rides, parcels, and deliveries in one place.
ar: كل الرحلات والطرود والتوصيل في مكان واحد.

# onboardingWelcomeGetStartedCta
source: Get started
ar: ابدأ الآن

# onboardingPermissionsTitle
source: Allow permissions
ar: الصلاحيات المطلوبة

# onboardingPermissionsLocation
source: Location access
ar: الوصول إلى الموقع

# onboardingPermissionsLocationSubtitle
source: We use your location to find nearby drivers.
ar: نستخدم موقعك للعثور على أقرب السائقين.

# onboardingPermissionsNotifications
source: Notifications
ar: الإشعارات

# onboardingPermissionsNotificationsSubtitle
source: Stay updated about your rides and deliveries.
ar: لإبقائك على اطلاع بحالة رحلاتك وطرودك.

# onboardingPermissionsContinueCta
source: Continue
ar: متابعة

# onboardingPermissionsSkipCta
source: Skip for now
ar: تخطي الآن

# onboardingPreferencesTitle
source: Set your preferences
ar: تهيئة التفضيلات

# onboardingPreferencesSubtitle
source: You can change these later in Settings.
ar: يمكنك تغيير هذه التفضيلات لاحقًا من الإعدادات.

# onboardingPreferencesPrimaryServiceTitle
source: What do you use most?
ar: ما الخدمة التي تستخدمها أكثر؟

# onboardingPreferencesServiceRides
source: Rides
ar: الرحلات

# onboardingPreferencesServiceRidesDesc
source: Get picked up and dropped off
ar: احصل على توصيلة من وإلى وجهتك

# onboardingPreferencesServiceParcels
source: Parcels
ar: الطرود

# onboardingPreferencesServiceParcelsDesc
source: Send and receive packages
ar: أرسل واستلم الطرود

# onboardingPreferencesServiceFood
source: Food
ar: الطعام

# onboardingPreferencesServiceFoodDesc
source: Order from restaurants
ar: اطلب من المطاعم

# onboardingPreferencesDoneCta
source: Start using Delivery Ways
ar: ابدأ استخدام Delivery Ways

# parcelsEntryTitle
source: Parcels
ar: الطرود
de: Pakete

# parcelsEntrySubtitle
source: Ship and track your parcels in one place.
ar: اشحن وتابع طرودك من مكان واحد.
de: Versenden und verfolgen Sie Ihre Pakete an einem Ort.

# parcelsEntryCreateShipmentCta
source: Create shipment
ar: إنشاء شحنة
de: Sendung erstellen

# parcelsEntryViewShipmentsCta
source: View shipments list
ar: عرض الشحنات
de: Sendungen anzeigen

# parcelsEntryComingSoonMessage
source: Parcels flows are coming soon.
ar: مسارات الطرود قيد التطوير.
de: Paketfunktionen werden bald verfügbar sein.

# parcelsEntryFooterNote
source: Parcels MVP is under active development.
ar: إصدار Parcels MVP قيد التطوير النشط.
de: Parcels MVP befindet sich in aktiver Entwicklung.

# parcelsComingSoonMessage
source: Parcels is coming soon.
ar: خدمة الطرود قادمة قريبًا.
de: Pakete sind bald verfügbar.

# parcelsDestinationTitle
source: Create shipment
ar: إنشاء شحنة
de: Sendung erstellen

# parcelsDestinationSubtitle
source: Enter where to pick up and where to deliver your parcel.
ar: أدخل عنوان الاستلام وعنوان التسليم لشحنتك.
de: Geben Sie Abhol- und Lieferadresse für Ihre Sendung ein.

# parcelsDestinationPickupLabel
source: Pickup address
ar: عنوان الاستلام
de: Abholadresse

# parcelsDestinationPickupHint
source: Enter pickup address
ar: أدخل عنوان الاستلام
de: Abholadresse eingeben

# parcelsDestinationDropoffLabel
source: Delivery address
ar: عنوان التسليم
de: Lieferadresse

# parcelsDestinationDropoffHint
source: Enter delivery address
ar: أدخل عنوان التسليم
de: Lieferadresse eingeben

# parcelsDestinationContinueCta
source: Continue
ar: متابعة
de: Weiter

# parcelsDetailsTitle
source: Parcel details
ar: تفاصيل الشحنة
de: Sendungsdetails

# parcelsDetailsSubtitle
source: Tell us more about your parcel to get accurate pricing.
ar: أدخل تفاصيل الشحنة للحصول على تسعير أدق.
de: Geben Sie Details zu Ihrer Sendung für eine genaue Preisberechnung ein.

# parcelsDetailsSizeLabel
source: Size
ar: الحجم
de: Größe

# parcelsDetailsWeightLabel
source: Weight
ar: الوزن
de: Gewicht

# parcelsDetailsWeightHint
source: e.g. 2.5 kg
ar: مثال: ٢٫٥ كجم
de: z.B. 2,5 kg

# parcelsDetailsContentsLabel
source: What are you sending?
ar: ما الذي تريد إرساله؟
de: Was senden Sie?

# parcelsDetailsContentsHint
source: Briefly describe the contents
ar: وصف مختصر لمحتوى الشحنة
de: Kurz den Inhalt beschreiben

# parcelsDetailsFragileLabel
source: This parcel is fragile
ar: هذه الشحنة قابلة للكسر
de: Dieses Paket ist zerbrechlich

# parcelsDetailsContinueCta
source: Review price
ar: مراجعة التسعيرة
de: Preis prüfen

# parcelsDetailsErrorWeightRequired
source: Please enter the parcel weight
ar: يرجى إدخال وزن الطرد
de: Bitte geben Sie das Gewicht des Pakets ein

# parcelsDetailsErrorPositiveNumber
source: Enter a valid positive number
ar: يرجى إدخال رقم صحيح موجب
de: Bitte eine gültige positive Zahl eingeben

# parcelsDetailsErrorContentsRequired
source: Please describe what you are sending
ar: يرجى وصف محتوى الشحنة
de: Bitte beschreiben Sie, was Sie versenden

# parcelsDetailsErrorSizeRequired
source: Please select a parcel size
ar: يرجى اختيار حجم الطرد
de: Bitte wählen Sie eine Paketgröße

# parcelsDetailsSectionParcelTitle
source: Parcel details
ar: تفاصيل الطرد
de: Paketdetails

# parcelsQuoteTitle
source: Shipment pricing
ar: تسعير الشحنة
de: Sendungspreise

# parcelsQuoteSubtitle
source: Choose how fast you want it delivered and how much you want to pay.
ar: اختر سرعة التوصيل والتكلفة المناسبة لك.
de: Wählen Sie, wie schnell und zu welchem Preis Sie liefern möchten.

# parcelsQuoteLoadingTitle
source: Fetching price options...
ar: جاري جلب خيارات التسعير...
de: Preise werden geladen...

# parcelsQuoteErrorTitle
source: We couldn't load price options
ar: تعذر تحميل خيارات التسعير
de: Preise konnten nicht geladen werden

# parcelsQuoteErrorSubtitle
source: Please check your connection and try again.
ar: يرجى التحقق من الاتصال بالإنترنت ثم المحاولة مرة أخرى.
de: Bitte überprüfen Sie Ihre Internetverbindung und versuchen Sie es erneut.

# parcelsQuoteEmptyTitle
source: No options available
ar: لا توجد خيارات متاحة
de: Keine Optionen verfügbar

# parcelsQuoteEmptySubtitle
source: Please adjust the parcel details and try again.
ar: يرجى تعديل تفاصيل الشحنة ثم المحاولة مرة أخرى.
de: Bitte passen Sie die Sendungsdetails an und versuchen Sie es erneut.

# parcelsQuoteRetryCta
source: Retry
ar: إعادة المحاولة
de: Erneut versuchen

# parcelsQuoteConfirmCta
source: Confirm shipment
ar: تأكيد الشحنة
de: Sendung bestätigen

# parcelsQuoteSummaryTitle
source: Shipment summary
ar: ملخص الشحنة
de: Sendungsübersicht

# parcelsQuoteFromLabel
source: From
ar: من
de: Von

# parcelsQuoteToLabel
source: To
ar: إلى
de: Nach

# parcelsQuoteWeightLabel
source: Weight
ar: الوزن
de: Gewicht

# parcelsQuoteSizeLabel
source: Size
ar: الحجم
de: Größe

# parcelsQuoteTotalLabel
source: Total: {amount}
ar: الإجمالي: {amount}
de: Gesamt: {amount}

# parcelsQuoteBreakdownStubNote
source: This is an estimated price. Final price may change after integration with the live pricing service.
ar: هذا سعر تقديري. قد يتغيّر السعر النهائي بعد الربط مع خدمة التسعير الفعلية.
de: Dies ist ein geschätzter Preis. Der endgültige Preis kann sich nach der Integration mit dem Live-Pricing-Service ändern.

# parcelsListTitle
source: Your shipments
ar: شحناتك
de: Deine Sendungen

# parcelsListSectionTitle
source: My shipments
ar: شحناتي
de: Meine Sendungen

# parcelsListEmptyTitle
source: No shipments yet
ar: لا توجد شحنات حتى الآن
de: Noch keine Sendungen

# parcelsListEmptySubtitle
source: When you create a shipment, it will appear here.
ar: عند إنشاء شحنة جديدة ستظهر هنا.
de: Wenn Sie eine Sendung erstellen, erscheint sie hier.

# parcelsListEmptyCta
source: Create first shipment
ar: أنشئ أول شحنة
de: Erste Sendung erstellen

# parcelsListNewShipmentTooltip
source: New shipment
ar: شحنة جديدة
de: Neue Sendung

# parcelsListCreatedAtLabel
source: Created on {date}
ar: تم الإنشاء في {date}
de: Erstellt am {date}

# parcelsListUnknownDestinationLabel
source: Unknown destination
ar: وجهة غير معروفة
de: Unbekanntes Ziel

# parcelsFilterAllLabel
source: All
ar: الكل
de: Alle

# parcelsFilterInProgressLabel
source: In progress
ar: قيد التنفيذ
de: In Bearbeitung

# parcelsFilterDeliveredLabel
source: Delivered
ar: تم التسليم
de: Zugestellt

# parcelsFilterCancelledLabel
source: Cancelled
ar: ملغاة
de: Storniert

# parcelsStatusScheduled
source: Scheduled
ar: مجدولة
de: Geplant

# parcelsStatusPickupPending
source: Pickup pending
ar: في انتظار الاستلام
de: Abholung ausstehend

# parcelsStatusPickedUp
source: Picked up
ar: تم الاستلام
de: Abgeholt

# parcelsStatusInTransit
source: In transit
ar: في الطريق
de: Unterwegs

# parcelsStatusDelivered
source: Delivered
ar: تم التسليم
de: Zugestellt

# parcelsStatusCancelled
source: Cancelled
ar: ملغاة
de: Storniert

# parcelsStatusFailed
source: Failed
ar: فشل في التسليم
de: Fehlgeschlagen

# parcelsCreateShipmentTitle
source: Create shipment
ar: شحنة جديدة
de: Sendung erstellen

# parcelsCreateSenderSectionTitle
source: Sender
ar: المرسل
de: Absender

# parcelsCreateReceiverSectionTitle
source: Receiver
ar: المستلم
de: Empfänger

# parcelsCreateDetailsSectionTitle
source: Parcel details
ar: تفاصيل الشحنة
de: Sendungsdetails

# parcelsCreateServiceSectionTitle
source: Service type
ar: نوع الخدمة
de: Serviceart

# parcelsCreateSenderNameLabel
source: Sender name
ar: اسم المرسل
de: Absendername

# parcelsCreateSenderPhoneLabel
source: Sender phone
ar: هاتف المرسل
de: Absendertelefon

# parcelsCreateSenderAddressLabel
source: Sender address
ar: عنوان المرسل
de: Absenderadresse

# parcelsCreateReceiverNameLabel
source: Receiver name
ar: اسم المستلم
de: Empfängername

# parcelsCreateReceiverPhoneLabel
source: Receiver phone
ar: هاتف المستلم
de: Empfängertelefon

# parcelsCreateReceiverAddressLabel
source: Receiver address
ar: عنوان المستلم
de: Empfängeradresse

# parcelsCreateWeightLabel
source: Weight (kg)
ar: الوزن (كجم)
de: Gewicht (kg)

# parcelsCreateSizeLabel
source: Size
ar: الحجم
de: Größe

# parcelsCreateNotesLabel
source: Notes (optional)
ar: ملاحظات (اختياري)
de: Notizen (optional)

# parcelsCreateServiceExpress
source: Express
ar: سريع

# parcelsCreateServiceStandard
source: Standard
ar: عادي

# parcelsCreateShipmentCtaGetEstimate
source: Get estimate
ar: احصل على التقدير
de: Kostenvoranschlag

# parcelsCreateErrorRequired
source: This field is required
ar: هذا الحقل مطلوب
de: Dieses Feld ist erforderlich

# parcelsCreateErrorInvalidNumber
source: Please enter a valid number
ar: يرجى إدخال رقم صحيح
de: Bitte geben Sie eine gültige Zahl ein

# parcelsCreateErrorInvalidPhone
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صحيح
de: Bitte geben Sie eine gültige Telefonnummer ein

# parcelsCreateWeightInvalidError
source: Please enter a valid weight.
ar: يرجى إدخال وزن صحيح.
de: Bitte ein gültiges Gewicht eingeben.

# parcelsCreateEstimateComingSoonSnackbar
source: Shipment estimate is coming soon.
ar: تسعيرة الشحنة قيد التنفيذ وستتوفر قريباً.
de: Der Versandpreis ist bald verfügbar.

# parcelsCreateSizeSmallLabel
source: Small
ar: صغيرة
de: Klein

# parcelsCreateSizeMediumLabel
source: Medium
ar: متوسطة
de: Mittel

# parcelsCreateSizeLargeLabel
source: Large
ar: كبيرة
de: Groß

# parcelsCreateSizeOversizeLabel
source: Oversize
ar: ضخمة
de: Übergröße

# parcelsShipmentDetailsTitle
source: Shipment details
ar: تفاصيل الشحنة
de: Sendungsdetails

# parcelsShipmentDetailsCreatedAt
source: Created on {date}
ar: أُنشئت في {date}
de: Erstellt am {date}

# parcelsShipmentDetailsRouteSectionTitle
source: Route
ar: المسار

# parcelsShipmentDetailsPickupLabel
source: Pickup
ar: الاستلام
de: Abholadresse

# parcelsShipmentDetailsDropoffLabel
source: Dropoff
ar: التسليم
de: Lieferadresse

# parcelsShipmentDetailsAddressSectionTitle
source: Addresses
ar: العناوين
de: Adressen

# parcelsShipmentDetailsSenderLabel
source: Sender
ar: من (المرسل)
de: Absender

# parcelsShipmentDetailsReceiverLabel
source: Receiver
ar: إلى (المستلم)
de: Empfänger

# parcelsShipmentDetailsMetaSectionTitle
source: Parcel details
ar: تفاصيل الطرد
de: Paketdetails

# parcelsShipmentDetailsWeightLabel
source: Weight
ar: الوزن
de: Gewicht

# parcelsShipmentDetailsSizeLabel
source: Size
ar: الحجم
de: Größe

# parcelsShipmentDetailsNotesLabel
source: Notes
ar: ملاحظات
de: Notizen

# parcelsShipmentDetailsNotAvailable
source: N/A
ar: غير متوفر
de: N/V

# parcelsShipmentDetailsSizeSmall
source: Small
ar: صغير
de: Klein

# parcelsShipmentDetailsSizeMedium
source: Medium
ar: متوسط
de: Mittel

# parcelsShipmentDetailsSizeLarge
source: Large
ar: كبير
de: Groß

# parcelsShipmentDetailsSizeOversize
source: Oversize
ar: ضخم
de: Übergröße

# parcelsDetailsPriceLabel
source: Price
ar: السعر
de: Preis

# foodComingSoonAppBarTitle
source: Food delivery
ar: توصيل الطعام
de: Essenslieferung

# foodComingSoonTitle
source: Food delivery is coming soon
ar: خدمة توصيل الطعام قادمة قريباً
de: Essenslieferung kommt bald

# foodComingSoonSubtitle
source: We're working hard to bring food delivery to your area. Stay tuned!
ar: نعمل حالياً على إطلاق خدمة توصيل الطعام في منطقتك. ترقّب التحديث القادم!
de: Wir arbeiten daran, Essenslieferung in deine Region zu bringen. Bleib dran!

# foodComingSoonPrimaryCta
source: Back to home
ar: العودة إلى الرئيسية
de: Zurück zur Startseite

# foodRestaurantsAppBarTitle
source: Food delivery
ar: توصيل الطعام
de: Essenslieferung

# foodRestaurantsSearchPlaceholder
source: Search restaurants or cuisines
ar: ابحث عن مطاعم أو مطابخ
de: Suche nach Restaurants oder Küchen

# foodRestaurantsFilterAll
source: All
ar: الكل
de: Alle

# foodRestaurantsFilterBurgers
source: Burgers
ar: برجر
de: Burger

# foodRestaurantsFilterItalian
source: Italian
ar: إيطالي
de: Italienisch

# foodRestaurantsEmptyTitle
source: No restaurants found
ar: لا توجد مطاعم مطابقة
de: Keine Restaurants gefunden

# foodRestaurantsEmptySubtitle
source: Try changing the filters or search for a different cuisine.
ar: جرّب تغيير الفلاتر أو البحث عن نوع آخر من الأطعمة.
de: Ändere die Filter oder suche nach einer anderen Küche.

# foodRestaurantMenuError
source: Could not load menu. Please try again.
ar: تعذّر تحميل قائمة الطعام. يرجى المحاولة مرة أخرى.
de: Menü konnte nicht geladen werden. Bitte versuche es erneut.

# foodCartSummaryCta
source: {itemCount} items · {totalPrice} total
ar: {itemCount} عنصر · المجموع {totalPrice}
de: {itemCount} Artikel · Gesamt {totalPrice}

# foodCartCheckoutStub
source: Checkout not implemented yet. {itemCount} items, total {totalPrice}.
ar: إتمام الطلب غير مفعّل بعد. عدد العناصر {itemCount}، المجموع {totalPrice}.
de: Checkout ist noch nicht implementiert. {itemCount} Artikel, insgesamt {totalPrice}.

# ordersSectionParcelsTitle
source: Parcels
ar: الطرود
de: Pakete

# ordersSectionFoodTitle
source: Food
ar: الطعام
de: Essen

# ordersFilterFood
source: Food
ar: الطعام
de: Essen

# ordersFoodStatusPending
source: Pending
ar: قيد المعالجة
de: Ausstehend

# ordersFoodStatusInPreparation
source: In preparation
ar: قيد التحضير
de: In Zubereitung

# ordersFoodStatusOnTheWay
source: On the way
ar: في الطريق
de: Unterwegs

# ordersFoodStatusDelivered
source: Delivered
ar: تم التسليم
de: Geliefert

# ordersFoodStatusCancelled
source: Cancelled
ar: ملغي
de: Storniert

# ordersFoodCreatedAtLabel
source: Ordered on {date}
ar: تم الطلب في {date}
de: Bestellt am {date}

# foodCartOrderCreatedSnackbar
source: Your order from {restaurant} has been created.
ar: تم إنشاء طلبك من {restaurant}.
de: Deine Bestellung bei {restaurant} wurde erstellt.

# homeFoodComingSoonLabel
source: Coming soon
ar: قريباً
de: Kommt bald

# homeFoodComingSoonMessage
source: Food delivery is not available yet in your area.
ar: خدمة توصيل الطعام غير متاحة بعد في منطقتك.
de: Essenslieferung ist in deiner Region noch nicht verfügbar.

# homeFoodCardTitle
source: Food
ar: الطعام
de: Essen

# homeFoodCardSubtitle
source: Your favorite food, delivered.
ar: طعامك المفضل، إليك.
de: Dein Lieblingsessen, geliefert.

# onboardingRideTitle
source: Get a Ride, Instantly.
ar: احصل على رحلة، فورًا.
de: Sofort eine Fahrt bekommen.

# onboardingRideBody
source: Tap, ride, and arrive. Fast, reliable, and affordable transport at your fingertips.
ar: اضغط، اركب، ووصل. تنقل سريع، موثوق، وبسعر مناسب في متناول يدك.
de: Tippen, fahren und ankommen. Schneller, zuverlässiger und günstiger Transport.

# onboardingParcelsTitle
source: Deliver Anything, Effortlessly.
ar: أرسل أي شيء، بسهولة.
de: Alles einfach versenden.
