Repository: abdulrhmanasami/DW_workspace
Catalog: lib/l10n/app_*.arb
Languages: ar, de

# authPhoneTitle
source: Sign in
ar: تسجيل الدخول
de: Anmelden

# authPhoneSubtitle
source: Enter your mobile number to sign in to Delivery Ways.
ar: أدخل رقم جوالك لتسجيل الدخول إلى Delivery Ways.
de: Geben Sie Ihre Handynummer ein, um sich bei Delivery Ways anzumelden.

# authPhoneContinueCta
source: Continue
ar: متابعة
de: Weiter

# authOtpTitle
source: Enter code
ar: إدخال الرمز
de: Code eingeben

# authOtpSubtitle
source: We've sent a verification code to your phone.
ar: قمنا بإرسال رمز تحقق إلى جوالك.
de: Wir haben einen Verifizierungscode an Ihr Telefon gesendet.

# authOtpFieldHint
source: Verification code
ar: رمز التحقق
de: Verifizierungscode

# authOtpVerifyCta
source: Verify and continue
ar: تأكيد ومتابعة
de: Verifizieren und fortfahren

# accountSheetTitle
source: Account
ar: الحساب
de: Konto

# accountSheetSignedOutSubtitle
source: You are not signed in. Sign in to sync your rides and deliveries.
ar: أنت غير مسجل الدخول. سجّل دخولك لمزامنة الرحلات والتوصيل.
de: Sie sind nicht angemeldet. Melden Sie sich an, um Ihre Fahrten und Lieferungen zu synchronisieren.

# accountSheetSignInCta
source: Sign in with phone
ar: تسجيل الدخول برقم الجوال
de: Mit Telefon anmelden

# accountSheetSignedInTitle
source: Signed in
ar: تم تسجيل الدخول
de: Angemeldet

# accountSheetSignOutCta
source: Sign out
ar: تسجيل الخروج
de: Abmelden

# accountSheetFooterText
source: More account options coming soon.
ar: المزيد من خيارات الحساب قريبًا.
de: Weitere Kontooptionen demnächst verfügbar.

source: Initializing...
ar: جارٍ التهيئة...
de: Initialisierung...

source: Back
ar: العودة
de: Zurück

source: Retry
ar: إعادة المحاولة
de: Erneut versuchen

source: Cancel
ar: إلغاء
de: Abbrechen

source: Save
ar: حفظ
de: Speichern

source: Confirm
ar: تأكيد
de: Bestätigen

source: OK
ar: موافق

source: Close
ar: إغلاق
de: Schließen

source: Error
ar: خطأ
de: Fehler

source: Loading...
ar: جارٍ التحميل...
de: Laden...

source: Coming soon
ar: قريباً
de: Demnächst verfügbar

# authPhoneLoginTitle
source: Sign In
ar: تسجيل الدخول
de: Anmelden

# authPhoneLoginSubtitle
source: Enter your phone number to sign in or create a new account.
ar: أدخل رقم جوالك لتسجيل الدخول أو إنشاء حساب جديد.
de: Geben Sie Ihre Telefonnummer ein, um sich anzumelden oder ein neues Konto zu erstellen.

# authPhoneFieldLabel
source: Phone Number
ar: رقم الجوال
de: Telefonnummer

# authPhoneContinueButton
source: Continue
ar: متابعة
de: Weiter

# authPhoneRequiredError
source: Please enter your phone number.
ar: يرجى إدخال رقم الجوال.
de: Bitte geben Sie Ihre Telefonnummer ein.

# authPhoneInvalidFormatError
source: Please enter a valid phone number.
ar: يرجى إدخال رقم جوال صحيح.
de: Bitte geben Sie eine gültige Telefonnummer ein.

# authPhoneSubmitError
source: Unable to send verification code. Please try again.
ar: تعذّر إرسال رمز التحقق. حاول مرة أخرى.
de: Verifizierungscode konnte nicht gesendet werden. Bitte versuchen Sie es erneut.

# authOtpFieldLabel
source: Verification Code
ar: رمز التحقق
de: Verifizierungscode

# authOtpConfirmButton
source: Verify
ar: تأكيد
de: Verifizieren

# authOtpRequiredError
source: Please enter the verification code.
ar: يرجى إدخال رمز التحقق.
de: Bitte geben Sie den Verifizierungscode ein.

# authOtpInvalidFormatError
source: Please enter a valid 4-6 digit code.
ar: يرجى إدخال رمز مكون من 4-6 أرقام.
de: Bitte geben Sie einen gültigen 4-6-stelligen Code ein.

# authOtpSubmitError
source: Invalid or expired verification code.
ar: رمز التحقق غير صحيح أو منتهي الصلاحية.
de: Ungültiger oder abgelaufener Verifizierungscode.

# authOtpResendButton
source: Resend Code
ar: إعادة إرسال الرمز
de: Code erneut senden

# authOtpResendCountdown
source: Resend code in {seconds} seconds
ar: يمكنك إعادة إرسال الرمز بعد {seconds} ثانية
de: Code erneut senden in {seconds} Sekunden

# authBiometricButtonLabel
source: Use biometrics
ar: استخدام البصمة
de: Biometrie verwenden

# authBiometricReason
source: Authenticate to continue.
ar: قم بالمصادقة للمتابعة.
de: Authentifizieren Sie sich, um fortzufahren.

# authBiometricUnlockError
source: Unable to unlock with biometrics. Please request a new code.
ar: تعذّر الفتح بالبصمة. يرجى طلب رمز جديد.
de: Entsperren mit Biometrie nicht möglich. Bitte fordern Sie einen neuen Code an.

# authCooldownMessage
source: Please wait {seconds}s before trying again.
ar: يرجى الانتظار {seconds} ثانية قبل المحاولة مجدداً.
de: Bitte warten Sie {seconds}s, bevor Sie es erneut versuchen.

# authCooldownReady
source: You can resend now.
ar: يمكنك إعادة الإرسال الآن.
de: Sie können jetzt erneut senden.

# authAttemptsRemaining
source: {count} attempts remaining
ar: {count} محاولات متبقية
de: {count} Versuche übrig

# authNoAttemptsRemaining
source: No attempts remaining.
ar: لا توجد محاولات متبقية.
de: Keine Versuche mehr übrig.

# auth2faTitle
source: Two-Factor Authentication
ar: التحقق الثنائي
de: Zwei-Faktor-Authentifizierung

# auth2faSubtitle
source: An additional verification step is required for your security.
ar: مطلوب خطوة تحقق إضافية لأمانك.
de: Ein zusätzlicher Verifizierungsschritt ist für Ihre Sicherheit erforderlich.

# auth2faSelectMethod
source: Select verification method
ar: اختر طريقة التحقق
de: Verifizierungsmethode auswählen

# auth2faMethodSms
source: Text Message (SMS)
ar: رسالة نصية (SMS)
de: SMS

# auth2faMethodSmsDescription
source: Receive a code via SMS to {destination}
ar: استلام رمز عبر SMS إلى {destination}
de: Code per SMS an {destination} erhalten

# auth2faMethodTotp
source: Authenticator App
ar: تطبيق المصادقة

# auth2faMethodTotpDescription
source: Use your authenticator app to generate a code
ar: استخدم تطبيق المصادقة لتوليد رمز
de: Verwenden Sie Ihre Authenticator-App, um einen Code zu generieren

# auth2faMethodEmail
source: Email
ar: البريد الإلكتروني

# auth2faMethodEmailDescription
source: Receive a code via email to {destination}
ar: استلام رمز عبر البريد الإلكتروني إلى {destination}
de: Code per E-Mail an {destination} erhalten

# auth2faMethodPush
source: Push Notification
ar: إشعار فوري
de: Push-Benachrichtigung

# auth2faMethodPushDescription
source: Approve the request on your registered device
ar: الموافقة على الطلب من جهازك المسجّل
de: Bestätigen Sie die Anfrage auf Ihrem registrierten Gerät

# auth2faEnterCode
source: Enter verification code
ar: أدخل رمز التحقق
de: Verifizierungscode eingeben

# auth2faCodeHint
source: Enter the 6-digit code
ar: أدخل الرمز المكون من 6 أرقام
de: 6-stelligen Code eingeben

# auth2faVerifyButton
source: Verify
ar: تأكيد
de: Verifizieren

# auth2faCancelButton
source: Cancel
ar: إلغاء
de: Abbrechen

# auth2faResendCode
source: Resend code
ar: إعادة إرسال الرمز
de: Code erneut senden

# auth2faCodeExpired
source: Code expired. Please request a new one.
ar: انتهت صلاحية الرمز. اطلب رمزاً جديداً.
de: Code abgelaufen. Bitte fordern Sie einen neuen an.

# auth2faInvalidCode
source: Invalid code. Please try again.
ar: رمز غير صحيح. حاول مرة أخرى.
de: Ungültiger Code. Bitte versuchen Sie es erneut.

# auth2faAccountLocked
source: Too many attempts. Account temporarily locked.
ar: محاولات كثيرة. تم قفل الحساب مؤقتاً.
de: Zu viele Versuche. Konto vorübergehend gesperrt.

# auth2faLockoutMessage
source: Please try again after {minutes} minutes.
ar: يرجى المحاولة بعد {minutes} دقيقة.
de: Bitte versuchen Sie es nach {minutes} Minuten erneut.

# notificationsSettingsTitle
source: Notification Settings
ar: إعدادات الإشعارات
de: Benachrichtigungseinstellungen

# notificationsSettingsOrderStatusTitle
source: Order Status Notifications
ar: إشعارات حالة الطلب
de: Bestellstatus-Benachrichtigungen

# notificationsSettingsOrderStatusSubtitle
source: Receive real-time updates about your active orders.
ar: استلام تحديثات مباشرة عن حالة طلباتك النشطة.
de: Erhalten Sie Echtzeit-Updates zu Ihren aktiven Bestellungen.

# notificationsSettingsPromotionsTitle
source: Promotional Offers
ar: العروض الترويجية
de: Werbeaktionen

# notificationsSettingsPromotionsSubtitle
source: Receive personalized offers and discounts.
ar: استلام عروض وخصومات مخصصة لك.
de: Erhalten Sie personalisierte Angebote und Rabatte.

# notificationsSettingsSystemTitle
source: System Notifications
ar: إشعارات النظام
de: Systembenachrichtigungen

# notificationsSettingsSystemSubtitle
source: Important alerts about your account and system.
ar: تنبيهات مهمة حول حسابك والنظام.
de: Wichtige Hinweise zu Ihrem Konto und System.

# notificationsSettingsConsentRequired
source: Grant notification permission to enable these settings.
ar: يجب منح إذن الإشعارات لتفعيل هذه الإعدادات.
de: Erteilen Sie die Benachrichtigungsberechtigung, um diese Einstellungen zu aktivieren.

# notificationsSettingsErrorGeneric
source: Unable to load notification settings. Please try again.
ar: تعذّر تحميل إعدادات الإشعارات. حاول مرة أخرى.
de: Benachrichtigungseinstellungen konnten nicht geladen werden. Bitte versuchen Sie es erneut.

# notificationsSettingsErrorLoading
source: Error loading notification settings
ar: حدث خطأ في تحميل إعدادات الإشعارات
de: Fehler beim Laden der Benachrichtigungseinstellungen

# notificationsSettingsSystemSettingsButton
source: Open System Settings
ar: فتح إعدادات النظام
de: Systemeinstellungen öffnen

# notificationsSettingsSystemSettingsPlaceholder
source: System settings will open soon
ar: سيتم فتح إعدادات النظام قريباً
de: Systemeinstellungen werden bald geöffnet

# notificationsSettingsQuietHoursTitle
source: Quiet Hours
ar: ساعات الهدوء
de: Ruhezeiten

# notificationsSettingsQuietHoursNotEnabled
source: Do Not Disturb mode not enabled
ar: لم يتم تفعيل وضع عدم الإزعاج
de: Bitte-nicht-stören-Modus nicht aktiviert

# settingsSectionNotifications
source: Notification Settings
ar: إعدادات الإشعارات
de: Benachrichtigungseinstellungen

# notificationsInboxTitle
source: Notifications
ar: الإشعارات
de: Benachrichtigungen

# notificationsInboxErrorGeneric
source: Unable to load notifications. Please try again.
ar: تعذّر تحميل الإشعارات. حاول مرة أخرى.
de: Benachrichtigungen konnten nicht geladen werden. Bitte versuchen Sie es erneut.

# notificationsInboxRetryButtonLabel
source: Retry
ar: إعادة المحاولة
de: Erneut versuchen

# notificationsInboxEmptyTitle
source: No notifications yet
ar: لا توجد إشعارات بعد
de: Noch keine Benachrichtigungen

# notificationsInboxEmptySubtitle
source: Important alerts about your orders and offers will appear here.
ar: ستظهر هنا التنبيهات المهمة عن طلباتك والعروض.
de: Wichtige Hinweise zu Ihren Bestellungen und Angeboten werden hier angezeigt.

# notificationsInboxEmptyCtaBackToHomeLabel
source: Back to Home
ar: العودة للرئيسية
de: Zurück zur Startseite

# notificationsInboxMarkAsReadTooltip
source: Mark as read
ar: وضع كمقروء
de: Als gelesen markieren

# notificationsInboxMarkAllAsReadTooltip
source: Mark all as read
ar: وضع الكل كمقروء
de: Alle als gelesen markieren

# notificationsInboxClearAllTooltip
source: Clear all
ar: مسح الكل
de: Alle löschen

# notificationsInboxClearAllDialogTitle
source: Clear All Notifications
ar: مسح جميع الإشعارات
de: Alle Benachrichtigungen löschen

# notificationsInboxClearAllDialogMessage
source: Are you sure you want to delete all notifications? This action cannot be undone.
ar: هل أنت متأكد من حذف جميع الإشعارات؟ لا يمكن التراجع عن هذا الإجراء.
de: Möchten Sie wirklich alle Benachrichtigungen löschen? Diese Aktion kann nicht rückgängig gemacht werden.

# notificationsInboxClearAllConfirm
source: Clear All
ar: مسح الكل
de: Alle löschen

# notificationsInboxTappedGeneric
source: Notification opened
ar: تم فتح الإشعار
de: Benachrichtigung geöffnet

# notificationsInboxTimeNow
source: now
ar: الآن
de: jetzt

# notificationsInboxTimeMinutes
source: {minutes}m ago
ar: منذ {minutes} دقيقة
de: vor {minutes}min

# notificationsInboxTimeHours
source: {hours}h ago
ar: منذ {hours} ساعة
de: vor {hours}h

# notificationsInboxTimeDays
source: {days}d ago
ar: منذ {days} يوم
de: vor {days}T

# privacyConsentTitle
source: Privacy & Consent
ar: الخصوصية والموافقة
de: Datenschutz & Einwilligung

# privacyConsentHeadline
source: Control your privacy
ar: تحكم في خصوصيتك
de: Kontrollieren Sie Ihre Privatsphäre

# privacyConsentDescription
source: Choose what to share with us to improve your experience
ar: اختر ما تريد مشاركته معنا لتحسين تجربتك
de: Wählen Sie, was Sie mit uns teilen möchten, um Ihre Erfahrung zu verbessern

# privacyConsentAnalyticsTitle
source: Usage Analytics
ar: تحليلات الاستخدام
de: Nutzungsanalysen

# privacyConsentAnalyticsDescription
source: Helps us understand how the app is used to improve performance and features
ar: يساعدنا في فهم كيفية استخدام التطبيق لتحسين الأداء والميزات
de: Hilft uns zu verstehen, wie die App genutzt wird, um Leistung und Funktionen zu verbessern

# privacyConsentCrashReportsTitle
source: Crash Reports
ar: تقارير الأعطال
de: Absturzberichte

# privacyConsentCrashReportsDescription
source: Automatically sends crash reports to help us fix issues
ar: يرسل تقارير تلقائية عند حدوث أعطال لمساعدتنا في إصلاح المشاكل
de: Sendet automatisch Absturzberichte, um uns bei der Behebung von Problemen zu helfen

# privacyConsentBackgroundLocationTitle
source: Background Location
ar: الموقع في الخلفية
de: Standort im Hintergrund

# privacyConsentBackgroundLocationDescription
source: Allows location tracking even when the app is closed to improve delivery services
ar: يسمح بتتبع الموقع حتى عندما يكون التطبيق مغلقاً لتحسين خدمات التوصيل
de: Ermöglicht Standortverfolgung auch bei geschlossener App zur Verbesserung der Lieferservices

# privacyConsentSaveSuccess
source: Privacy settings saved
ar: تم حفظ إعدادات الخصوصية
de: Datenschutzeinstellungen gespeichert

# privacyConsentErrorPrefix
source: Error: {message}
ar: خطأ: {message}
de: Fehler: {message}

# dsrExportTitle
source: Export Data
ar: تصدير البيانات
de: Daten exportieren

# dsrExportHeadline
source: Export your personal data
ar: تصدير بياناتك الشخصية
de: Exportieren Sie Ihre persönlichen Daten

# dsrExportDescription
source: You will receive a secure link to download all your data. The link is valid for 7 days only.
ar: ستحصل على رابط آمن لتنزيل جميع بياناتك. الرابط صالح لمدة 7 أيام فقط.
de: Sie erhalten einen sicheren Link zum Herunterladen aller Ihrer Daten. Der Link ist nur 7 Tage gültig.

# dsrExportIncludePaymentsTitle
source: Include payment history
ar: تضمين سجل المدفوعات
de: Zahlungsverlauf einschließen

# dsrExportIncludePaymentsDescription
source: Payment history may contain sensitive information. Please review the file carefully.
ar: قد يحتوي سجل المدفوعات على معلومات حساسة. تأكد من مراجعة الملف بعناية.
de: Der Zahlungsverlauf kann sensible Informationen enthalten. Bitte überprüfen Sie die Datei sorgfältig.

# dsrExportStartButton
source: Start Export
ar: ابدأ التصدير
de: Export starten

# dsrExportRequestStatus
source: Request Status
ar: حالة الطلب
de: Anfragestatus

# dsrExportRequestDate
source: Request date: {date}
ar: تاريخ الطلب: {date}
de: Antragsdatum: {date}

# dsrExportDownloadLink
source: Download Link
ar: رابط التنزيل

# dsrExportLinkExpires
source: Expires: {date}
ar: ينتهي في: {date}
de: Läuft ab: {date}

# dsrExportCopyLink
source: Copy Link
ar: نسخ الرابط
de: Link kopieren

# dsrExportLinkCopied
source: Link copied
ar: تم نسخ الرابط
de: Link kopiert

# dsrExportPreparingFile
source: Preparing your file…
ar: جارٍ تجهيز ملفك…
de: Ihre Datei wird vorbereitet…

# dsrExportSendingRequest
source: Sending export request…
ar: جارٍ إرسال طلب التصدير…
de: Exportanfrage wird gesendet…

# dsrExportRequestFailed
source: Failed to send request
ar: فشل في إرسال الطلب
de: Anfrage konnte nicht gesendet werden

# dsrErasureTitle
source: Delete Account
ar: حذف الحساب
de: Konto löschen

# dsrErasureHeadline
source: Permanently delete your account
ar: حذف حسابك نهائياً
de: Konto dauerhaft löschen

# dsrErasureDescription
source: This action cannot be undone. All your data and account information will be deleted.
ar: هذا الإجراء لا رجعة فيه. سيتم حذف جميع بياناتك وبيانات حسابك.
de: Diese Aktion kann nicht rückgängig gemacht werden. Alle Ihre Daten und Kontoinformationen werden gelöscht.

# dsrErasureRequestButton
source: Request Account Deletion
ar: طلب حذف الحساب
de: Kontolöschung beantragen

# dsrErasureWarningTitle
source: Important Warning
ar: تحذير مهم
de: Wichtige Warnung

# dsrErasureWarningPoint1
source: All your personal data will be permanently deleted
ar: سيتم حذف جميع بياناتك الشخصية نهائياً
de: Alle Ihre persönlichen Daten werden dauerhaft gelöscht

# dsrErasureWarningPoint2
source: You will not be able to recover your account or data
ar: لن تتمكن من استرجاع حسابك أو بياناتك
de: Sie können Ihr Konto oder Ihre Daten nicht wiederherstellen

# dsrErasureWarningPoint3
source: All active orders and reservations will be cancelled
ar: سيتم إلغاء جميع الطلبات والحجوزات النشطة
de: Alle aktiven Bestellungen und Reservierungen werden storniert

# dsrErasureWarningPoint4
source: Your payment and transaction history will be deleted
ar: سيتم حذف سجل المدفوعات والمعاملات
de: Ihr Zahlungs- und Transaktionsverlauf wird gelöscht

# dsrErasureWarningPoint5
source: The request may take several days to process
ar: قد يستغرق تنفيذ الطلب عدة أيام
de: Die Bearbeitung der Anfrage kann mehrere Tage dauern

# dsrErasureLegalNotice
source: Account deletion is subject to the General Data Protection Regulation (GDPR). We will send you confirmation before executing the final deletion.
ar: حذف الحساب يخضع للائحة حماية البيانات العامة (GDPR). سنرسل لك تأكيداً قبل تنفيذ الحذف النهائي.
de: Die Kontolöschung unterliegt der Datenschutz-Grundverordnung (DSGVO). Wir senden Ihnen vor der endgültigen Löschung eine Bestätigung.

# dsrErasureRequestStatus
source: Request Status
ar: حالة الطلب
de: Anfragestatus

# dsrErasureStatusPending
source: Pending review
ar: في انتظار المراجعة
de: Wartet auf Überprüfung

# dsrErasureStatusInProgress
source: Processing
ar: قيد المعالجة
de: In Bearbeitung

# dsrErasureStatusReady
source: Ready for confirmation
ar: جاهز للتأكيد
de: Bereit zur Bestätigung

# dsrErasureStatusCompleted
source: Completed
ar: مكتمل
de: Abgeschlossen

# dsrErasureStatusFailed
source: Processing failed
ar: فشل في المعالجة
de: Verarbeitung fehlgeschlagen

# dsrErasureStatusCanceled
source: Canceled
ar: ملغي
de: Abgebrochen

# dsrErasureReviewingRequest
source: Reviewing your request…
ar: جارٍ مراجعة طلبك…
de: Ihre Anfrage wird überprüft…

# dsrErasureSendingRequest
source: Sending deletion request…
ar: جارٍ إرسال طلب الحذف…
de: Löschanfrage wird gesendet…

# dsrErasureRequestFailed
source: Failed to send request
ar: فشل في إرسال الطلب
de: Anfrage konnte nicht gesendet werden

# dsrErasureNewRequest
source: Request New Deletion
ar: طلب حذف جديد
de: Neue Löschung beantragen

# dsrErasureConfirmTitle
source: Confirm Final Deletion
ar: تأكيد الحذف النهائي
de: Endgültige Löschung bestätigen

# dsrErasureConfirmMessage
source: This is the final step. After confirmation, your account will be permanently deleted within 30 days and this decision cannot be reversed.
ar: هذا هو الخطوة الأخيرة. بعد التأكيد، سيتم حذف حسابك نهائياً خلال 30 يوماً ولن يمكن التراجع عن هذا القرار.
de: Dies ist der letzte Schritt. Nach der Bestätigung wird Ihr Konto innerhalb von 30 Tagen dauerhaft gelöscht und diese Entscheidung kann nicht rückgängig gemacht werden.

# dsrErasureConfirmButton
source: Confirm Deletion
ar: تأكيد الحذف
de: Löschung bestätigen

# legalPrivacyPolicyTitle
source: Privacy Policy
ar: سياسة الخصوصية
de: Datenschutzrichtlinie

# legalPrivacyPolicyUnavailable
source: Privacy policy is not available at this time.
ar: سياسة الخصوصية غير متاحة حالياً.
de: Die Datenschutzrichtlinie ist derzeit nicht verfügbar.

# legalTermsOfServiceTitle
source: Terms of Service
ar: شروط الاستخدام
de: Nutzungsbedingungen

# legalTermsOfServiceUnavailable
source: Terms of service are not available at this time.
ar: شروط الاستخدام غير متاحة حالياً.
de: Die Nutzungsbedingungen sind derzeit nicht verfügbar.

# legalAboutTitle
source: Legal Information
ar: المعلومات القانونية
de: Rechtliche Informationen

# legalPrivacyButton
source: Privacy Policy
ar: سياسة الخصوصية
de: Datenschutzrichtlinie

# legalTermsButton
source: Terms of Service
ar: شروط الاستخدام
de: Nutzungsbedingungen

# legalOpenSourceLicenses
source: Open Source Licenses
ar: التراخيص المفتوحة المصدر
de: Open-Source-Lizenzen

# ordersTitle
source: Orders
ar: الطلبات
de: Bestellungen

# ordersOrderLabel
source: Order: {orderId}
ar: الطلب: {orderId}
de: Bestellung: {orderId}

# cartTitle
source: Cart
ar: السلة
de: Warenkorb

# cartItemsLabel
source: Items: {count}
ar: العناصر: {count}
de: Artikel: {count}

# checkoutTitle
source: Checkout
ar: الدفع
de: Zur Kasse

# paymentTitle
source: Payment
ar: الدفع
de: Zahlung

# paymentInitializing
source: Initializing payment system...
ar: جارٍ تهيئة نظام الدفع...
de: Zahlungssystem wird initialisiert...

# paymentDebugTitle
source: Payments Debug
ar: تصحيح المدفوعات
de: Zahlungs-Debug

# paymentEnabled
source: Payments enabled: {enabled}
ar: المدفوعات مفعلة: {enabled}
de: Zahlungen aktiviert: {enabled}

# paymentMissingKeys
source: Missing config keys: {keys}
ar: مفاتيح الإعداد المفقودة: {keys}
de: Fehlende Konfigurationsschlüssel: {keys}

# paymentGatewayStatus
source: Gateway status: {status}
ar: حالة البوابة: {status}

# paymentGateway
source: Gateway: {type}
ar: البوابة: {type}

# paymentSheetStatus
source: Sheet status: {status}
ar: حالة الشاشة: {status}

# paymentSheet
source: Sheet: {type}
ar: الشاشة: {type}

# paymentApplePay
source: Pay with Apple Pay
ar: الدفع بـ Apple Pay
de: Mit Apple Pay bezahlen

# paymentGooglePay
source: Pay with Google Pay
ar: الدفع بـ Google Pay
de: Mit Google Pay bezahlen

# paymentDigitalWallet
source: Pay with Digital Wallet
ar: الدفع بالمحفظة الرقمية
de: Mit Digital Wallet bezahlen

# paymentCash
source: Pay with Cash
ar: الدفع نقداً
de: Bar bezahlen

# trackingTitle
source: Tracking
ar: التتبع
de: Sendungsverfolgung

# trackingLocationTitle
source: Location Tracking
ar: تتبع الموقع
de: Standortverfolgung

# trackingCurrentLocation
source: Current Location
ar: موقعك الحالي
de: Aktueller Standort

# trackingTripRoute
source: Trip Route
ar: مسار الرحلة
de: Fahrtroute

# trackingRealtimeUnavailableTitle
source: Live Tracking Unavailable
ar: التتبع اللحظي غير متاح
de: Live-Tracking nicht verfügbar

# trackingRealtimeUnavailableBody
source: Real-time tracking is currently unavailable. Your order status will be updated automatically.
ar: التتبّع اللحظي غير متاح حاليًا، سيتم تحديث حالة الطلب تلقائيًا.
de: Die Echtzeit-Sendungsverfolgung ist derzeit nicht verfügbar. Ihr Bestellstatus wird automatisch aktualisiert.

# trackingOrderStatus
source: Order Status
ar: حالة الطلب
de: Bestellstatus

# trackingNoActiveTrip
source: No active trip
ar: لا توجد رحلة نشطة
de: Keine aktive Fahrt

# mapTitle
source: Map
ar: الخريطة
de: Karte

# mapSmokeTestTitle
source: Maps Smoke Test
ar: اختبار الخرائط
de: Karten-Smoke-Test

# mapTestLocation
source: Test Location
ar: موقع الاختبار
de: Teststandort

# mobilityBgTestsTitle
source: Mobility Background Tests (Phase-3)
ar: اختبارات التنقل في الخلفية (المرحلة 3)
de: Mobilitäts-Hintergrundtests (Phase-3)

# mobilityTestBackgroundTracking
source: Test Background Tracking
ar: اختبار التتبع في الخلفية
de: Hintergrundverfolgung testen

# mobilityTestGeofence
source: Test Geofence
ar: اختبار السياج الجغرافي
de: Geofence testen

# mobilityTestTripRecording
source: Test Trip Recording
ar: اختبار تسجيل الرحلة
de: Fahrtaufzeichnung testen

# adminPanelTitle
source: Admin Panel
ar: لوحة التحكم

# adminUserInfo
source: User Information
ar: معلومات المستخدم
de: Benutzerinformationen

# adminUserLabel
source: User: {userId}
ar: المستخدم: {userId}
de: Benutzer: {userId}

# adminRoleLabel
source: Role: {role}
ar: الدور: {role}
de: Rolle: {role}

# adminUserManagement
source: User Management
ar: إدارة المستخدمين
de: Benutzerverwaltung
