Repository: abdulrhmanasami/DW_workspace
Catalog: lib/l10n/app_*.arb
Languages: ar, de

# onboardingParcelsBody
source: From documents to gifts, send and track your parcels with ease and confidence.
ar: من المستندات إلى الهدايا، أرسل وتتبع طرودك بسهولة وثقة.
de: Von Dokumenten bis Geschenken – sende und verfolge deine Pakete mit Leichtigkeit.

# onboardingFoodTitle
source: Your Favorite Food, Delivered.
ar: طعامك المفضل، إليك.
de: Dein Lieblingsessen, geliefert.

# onboardingFoodBody
source: Explore local restaurants and enjoy fast delivery right to your door.
ar: استكشف المطاعم القريبة واستمتع بتوصيل سريع حتى باب منزلك.
de: Entdecke lokale Restaurants und genieße schnelle Lieferung bis vor deine Tür.

# onboardingButtonContinue
source: Continue
ar: استمر
de: Weiter

# onboardingButtonGetStarted
source: Get Started
ar: ابدأ الآن
de: Los geht's

# homeRideCardTitle
source: Ride
ar: رحلة
de: Fahrt

# homeRideCardSubtitle
source: Get a ride, instantly.
ar: احصل على رحلة فوراً.
de: Sofort eine Fahrt bekommen.

# rideDestinationDestinationLabel
source: Destination
ar: الوجهة
de: Ziel

# rideDestinationDestinationPlaceholder
source: Where to?
ar: إلى أين؟
de: Wohin?

# rideDestinationRecentTitle
source: Recent destinations
ar: الوجهات الأخيرة
de: Letzte Ziele

# rideDestinationRecentHomeLabel
source: Home
ar: المنزل
de: Zuhause

# rideDestinationRecentHomeSubtitle
source: Saved home address
ar: عنوان المنزل المحفوظ
de: Gespeicherte Privatadresse

# rideDestinationRecentWorkLabel
source: Work
ar: العمل
de: Arbeit

# rideDestinationRecentWorkSubtitle
source: Saved work address
ar: عنوان العمل المحفوظ
de: Gespeicherte Arbeitsadresse

# rideDestinationRecentLastLabel
source: Last trip
ar: آخر رحلة
de: Letzte Fahrt

# rideDestinationRecentLastSubtitle
source: Use the destination from your last ride
ar: استخدم وجهة آخر رحلة
de: Ziel deiner letzten Fahrt verwenden

# rideDestinationNextCta
source: Next
ar: التالي
de: Weiter

# rideDestinationComingSoonSnackbar
source: Trip summary is coming soon.
ar: ملخص الرحلة قيد التنفيذ وسيتوفر قريباً.
de: Die Fahrzusammenfassung wird bald verfügbar sein.

# rideSummaryReceiptTitle
source: Receipt
ar: الإيصال
de: Beleg

# rideSummaryReceiptFareLabel
source: Fare
ar: أجرة الرحلة
de: Fahrtpreis

# rideSummaryReceiptFeesLabel
source: Fees
ar: الرسوم
de: Gebühren

# rideSummaryReceiptTotalLabel
source: Total
ar: الإجمالي
de: Gesamt

# rideSummaryRatingTitle
source: Rate your driver
ar: قيّم السائق
de: Bewerte deinen Fahrer

# rideSummaryRatingSubtitle
source: Your feedback helps keep rides safe and comfortable.
ar: ملاحظاتك تساعدنا في الحفاظ على رحلات آمنة ومريحة.
de: Dein Feedback hilft uns, Fahrten sicher und angenehm zu halten.

# rideSummaryCommentPlaceholder
source: Add a comment (optional)
ar: أضف ملاحظة (اختياري)
de: Kommentar hinzufügen (optional)

# rideReceiptTripIdLabel
source: Trip ID: {id}
ar: رقم الرحلة: {id}
de: Fahrt-ID: {id}

# rideReceiptCompletedAt
source: {date} at {time}
ar: {date} في {time}
de: {date} um {time}

# rideReceiptFromLabel
source: From
ar: من
de: Von

# rideReceiptToLabel
source: To
ar: إلى
de: Nach

# rideReceiptFareSectionTitle
source: Trip fare
ar: أجرة الرحلة
de: Fahrpreis

# rideReceiptBaseFareLabel
source: Base fare
ar: الأجرة الأساسية
de: Grundpreis

# rideReceiptDistanceFareLabel
source: Distance
ar: المسافة
de: Strecke

# rideReceiptTimeFareLabel
source: Time
ar: الوقت
de: Zeit

# rideReceiptFeesLabel
source: Fees & surcharges
ar: الرسوم والضرائب
de: Gebühren & Zuschläge

# rideReceiptTotalLabel
source: Total
ar: الإجمالي
de: Gesamt

# rideReceiptDriverSectionTitle
source: Driver & vehicle
ar: السائق والمركبة
de: Fahrer & Fahrzeug

# rideReceiptRateDriverTitle
source: Rate your driver
ar: قيّم تجربتك مع السائق
de: Fahrer bewerten

# rideReceiptRateDriverSubtitle
source: Your feedback helps keep rides safe and comfortable.
ar: ملاحظاتك تساعدنا على تحسين جودة الرحلات.
de: Dein Feedback hilft, Fahrten sicher und angenehm zu halten.

# rideReceiptDoneCta
source: Done
ar: تم
de: Fertig

# rideSummaryEndTripDebugCta
source: End trip
ar: إنهاء الرحلة
de: Fahrt beenden

# rideSummaryThankYouSnackbar
source: Thanks for your feedback.
ar: شكرًا لملاحظاتك.
de: Danke für dein Feedback.

# homeActiveParcelTitleGeneric
source: Active shipment
ar: شحنة نشطة
de: Aktive Sendung

# homeActiveParcelSubtitleToDestination
source: To {destination}
ar: إلى {destination}
de: Nach {destination}

# homeActiveParcelViewShipmentCta
source: View shipment
ar: عرض الشحنة
de: Sendung ansehen

# homeActiveParcelStatusPreparing
source: Preparing your shipment...
ar: جاري تجهيز شحنتك...
de: Deine Sendung wird vorbereitet...

# homeActiveParcelStatusScheduled
source: Pickup scheduled
ar: الاستلام مجدول
de: Abholung geplant

# homeActiveParcelStatusPickupPending
source: Waiting for pickup
ar: في انتظار الاستلام
de: Warten auf Abholung

# homeActiveParcelStatusPickedUp
source: Picked up
ar: تم الاستلام
de: Abgeholt

# homeActiveParcelStatusInTransit
source: In transit
ar: قيد النقل
de: Unterwegs

# homeActiveParcelStatusDelivered
source: Delivered
ar: تم التسليم
de: Zugestellt

# homeActiveParcelStatusCancelled
source: Shipment cancelled
ar: تم إلغاء الشحنة
de: Sendung storniert

# homeActiveParcelStatusFailed
source: Delivery failed
ar: فشل التسليم
de: Zustellung fehlgeschlagen

# parcelsActiveShipmentTitle
source: Active shipment
ar: الشحنة النشطة
de: Aktive Sendung

# parcelsActiveShipmentNoActiveTitle
source: No active shipment
ar: لا توجد شحنة نشطة
de: Keine aktive Sendung

# parcelsActiveShipmentNoActiveSubtitle
source: You don't have any active shipments right now.
ar: لا يوجد لديك شحنات نشطة حالياً.
de: Du hast derzeit keine aktiven Sendungen.

# parcelsActiveShipmentMapStub
source: Map tracking (coming soon)
ar: تتبع الخريطة (قريباً)
de: Kartenverfolgung (bald verfügbar)

# parcelsActiveShipmentStatusLabel
source: Status: {status}
ar: الحالة: {status}

# parcelsActiveShipmentIdLabel
source: Shipment ID: {id}
ar: رقم الشحنة: {id}
de: Sendungs-ID: {id}

# parcelsActiveShipmentStubNote
source: Full tracking will be available in a future update.
ar: سيتوفر التتبع الكامل في تحديث قادم.
de: Vollständige Verfolgung wird in einem zukünftigen Update verfügbar sein.

# parcelsDetailsCancelShipmentCta
source: Cancel shipment
ar: إلغاء الشحنة
de: Sendung stornieren

# parcelsCancelDialogTitle
source: Cancel this shipment?
ar: هل تريد إلغاء هذه الشحنة؟
de: Diese Sendung stornieren?

# parcelsCancelDialogSubtitle
source: If you cancel now, this shipment will be stopped and will no longer appear as active.
ar: إذا قمت بالإلغاء الآن، سيتم إيقاف هذه الشحنة ولن تظهر كشحنة نشطة.
de: Wenn du jetzt stornierst, wird diese Sendung gestoppt und nicht mehr als aktiv angezeigt.

# parcelsCancelDialogConfirmCta
source: Yes, cancel
ar: نعم، إلغاء
de: Ja, stornieren

# parcelsCancelDialogDismissCta
source: Keep shipment
ar: الإبقاء على الشحنة
de: Sendung behalten

# parcelsCancelSuccessMessage
source: Shipment has been cancelled.
ar: تم إلغاء الشحنة بنجاح.
de: Die Sendung wurde storniert.

# bottomNavHomeLabel
source: Home
ar: الرئيسية
de: Start

# bottomNavOrdersLabel
source: Orders
ar: الطلبات
de: Bestellungen

# bottomNavPaymentsLabel
source: Payments
ar: المدفوعات
de: Zahlungen

# bottomNavProfileLabel
source: Profile
ar: الحساب
de: Profil

# paymentsEntryTitle
source: Payments
ar: المدفوعات
de: Zahlungen

# paymentsEntryStubBody
source: Payments management will be available in a future update.
ar: إدارة المدفوعات ستتوفر في تحديث قادم.
de: Die Zahlungsverwaltung wird in einem zukünftigen Update verfügbar sein.

# paymentsTitle
source: Payments
ar: طرق الدفع
de: Zahlungsmethoden

# paymentsAddMethodCta
source: Add new payment method
ar: إضافة طريقة دفع جديدة
de: Neue Zahlungsmethode hinzufügen

# paymentsEmptyTitle
source: No payment methods saved
ar: لا توجد طرق دفع محفوظة
de: Keine Zahlungsmethoden gespeichert

# paymentsEmptyBody
source: Your saved cards and payment options will appear here.
ar: ستظهر هنا بطاقاتك وطرق الدفع المحفوظة.
de: Deine gespeicherten Karten und Zahlungsoptionen erscheinen hier.

# paymentsMethodTypeCash
source: Cash
ar: نقدًا
de: Barzahlung

# paymentsMethodTypeCard
source: Card
ar: بطاقة
de: Karte

# paymentsDefaultBadge
source: Default
ar: افتراضية
de: Standard

# paymentsAddMethodComingSoon
source: Adding new payment methods will be available soon.
ar: إضافة طرق دفع جديدة ستكون متاحة قريبًا.
de: Das Hinzufügen neuer Zahlungsmethoden ist bald verfügbar.

# profileEntryTitle
source: Profile
ar: الملف الشخصي
de: Profil

# profileEntryStubBody
source: Profile and account settings will be available in a future update.
ar: إعدادات الملف الشخصي والحساب ستتوفر في تحديث قادم.
de: Profil- und Kontoeinstellungen werden in einem zukünftigen Update verfügbar sein.

# rideStatusShortDraft
source: Draft
ar: مسودة
de: Entwurf

# rideStatusShortQuoting
source: Getting price
ar: جاري التسعير
de: Preis wird ermittelt

# rideStatusShortRequesting
source: Requesting ride
ar: جاري طلب الرحلة
de: Fahrt wird angefragt

# rideStatusShortFindingDriver
source: Finding driver
ar: جاري البحث عن سائق
de: Fahrer wird gesucht

# rideStatusShortDriverAccepted
source: Driver accepted
ar: تم قبول السائق
de: Fahrer akzeptiert

# rideStatusShortDriverArrived
source: Driver arrived
ar: وصل السائق
de: Fahrer angekommen

# rideStatusShortInProgress
source: In progress
ar: قيد التنفيذ
de: Unterwegs

# rideStatusShortPayment
source: Payment in progress
ar: جاري الدفع
de: Zahlung läuft

# rideStatusShortCompleted
source: Completed
ar: مكتملة
de: Abgeschlossen

# rideStatusShortCancelled
source: Cancelled
ar: ملغاة
de: Storniert

# rideStatusShortFailed
source: Failed
ar: فشلت
de: Fehlgeschlagen

# homeActiveRideStatusPreparing
source: Preparing your trip...
ar: جاري تجهيز رحلتك...
de: Deine Fahrt wird vorbereitet...

# homeActiveRideStatusFindingDriver
source: Looking for a driver...
ar: جاري البحث عن سائق...
de: Fahrer wird gesucht...

# homeActiveRideStatusDriverAccepted
source: Driver on the way
ar: السائق في الطريق إليك
de: Fahrer ist unterwegs

# homeActiveRideStatusDriverArrived
source: Driver has arrived
ar: وصل السائق
de: Fahrer ist angekommen

# homeActiveRideStatusInProgress
source: Trip in progress
ar: الرحلة جارية
de: Fahrt läuft

# homeActiveRideStatusPayment
source: Finalizing payment
ar: جاري إتمام الدفع
de: Zahlung wird abgeschlossen

# homeActiveRideStatusCompleted
source: Trip completed
ar: تم إنهاء الرحلة
de: Fahrt abgeschlossen

# homeActiveRideStatusCancelled
source: Trip cancelled
ar: تم إلغاء الرحلة
de: Fahrt storniert

# homeActiveRideStatusFailed
source: Trip failed
ar: فشلت الرحلة
de: Fahrt fehlgeschlagen

# rideActiveTripTitle
source: Active trip
ar: الرحلة النشطة
de: Aktive Fahrt

# rideActiveTripFromLabel
source: From: {pickup}
ar: من: {pickup}
de: Von: {pickup}

# rideActiveTripToLabel
source: To: {dropoff}
ar: إلى: {dropoff}
de: Nach: {dropoff}

# rideActiveTripIdLabel
source: Trip ID: {id}
ar: رقم الرحلة: {id}
de: Fahrt-ID: {id}

# rideActiveTripMapStub
source: Live map tracking (coming soon)
ar: تتبع الخريطة المباشر (قريبًا)
de: Live-Kartenverfolgung (bald verfügbar)

# rideActiveTripStubNote
source: Full live tracking will be available after integration with the mobility service.
ar: سيتم توفير تتبع مباشر كامل بعد الربط مع خدمة الرحلات الفعلية.
de: Vollständiges Live-Tracking wird nach der Integration mit dem Mobilitätsdienst verfügbar sein.

# rideActiveTripStatusLabel
source: Status: {status}
ar: الحالة: {status}

# rideActiveTripDriverSectionTitle
source: Driver & vehicle
ar: السائق والمركبة
de: Fahrer & Fahrzeug

# rideActiveTripDriverSectionStubBody
source: Driver and vehicle details will be available once the mobility integration is connected.
ar: تفاصيل السائق والمركبة ستظهر بعد الربط مع خدمة الرحلات الفعلية.
de: Details zu Fahrer und Fahrzeug werden nach der Integration mit dem Mobilitätsdienst verfügbar sein.

# authPhoneFieldHint
source: +9665xxxxxxxx
de: Handynummer

# ordersRideItemTitleWithService
source: {serviceName} to {destination}
de: {serviceName} nach {destination}

# ordersRideItemSubtitleWithOrigin
source: From {origin} · {date}
de: Von {origin} · {date}

# rideTripCompletionServiceLabel
source: {serviceName} ride
de: {serviceName} Fahrt

# rideQuoteErrorTitle
source: We couldn't load prices
de: Fahrtoptionen konnten nicht geladen werden

# rideQuoteErrorGeneric
source: Something went wrong while fetching ride prices. Please try again.
de: Bitte überprüfe deine Verbindung und versuche es erneut.

# rideQuoteErrorNoOptions
source: No ride options are available for this route right now.
de: Für diese Strecke sind derzeit keine Fahrtoptionen verfügbar.

# rideQuoteRetryCta
source: Retry
de: Erneut versuchen

# rideQuoteEmptyTitle
source: No rides available
de: Keine Fahrten verfügbar

# rideQuoteEmptyDescription
source: Try a different time or adjust your pickup and destination.
de: Bitte versuchen Sie es in ein paar Minuten erneut.

# rideTripSummaryFailedTitle
source: Ride failed
de: Fahrt fehlgeschlagen

# rideTripSummaryFailedSubtitle
source: We couldn't complete this ride
de: Diese Fahrt konnte nicht abgeschlossen werden

# rideFailReasonNoDriverFound
source: No driver found
de: Kein Fahrer gefunden

# rideFailNoDriverFoundSnackbar
source: We couldn't find a driver for this ride.
de: Es konnte kein Fahrer für diese Fahrt gefunden werden.

# rideFailNoDriverFoundCta
source: No drivers available? Try later
de: Keine Fahrer verfügbar? Später versuchen

# homeActiveRideEtaTitle
source: Arriving in {minutes} min
de: Ankunft in {minutes} Min.

# rideActivePayingWith
source: Paying with {method}
de: Bezahlen mit {method}

# rideActivePriceNotAvailable
source: Price not available yet
de: Preis noch nicht verfügbar

# rideCancelReasonByRider
source: Cancelled by rider
de: Vom Fahrgast storniert

# ordersHistoryEmptyAllTitle
source: No orders yet
de: Noch keine Bestellungen

# ordersHistoryEmptyAllDescription
source: Your rides, parcels and food orders will appear here.
de: Ihre Fahrten, Pakete und Essensbestellungen werden hier angezeigt.

# ordersHistoryEmptyRidesTitle
source: No rides yet
de: Noch keine Fahrten

# ordersHistoryEmptyRidesDescription
source: Your completed rides will appear here.
de: Ihre abgeschlossenen Fahrten werden hier angezeigt.

# ordersHistoryEmptyParcelsTitle
source: No parcels yet
de: Noch keine Pakete

# ordersHistoryEmptyParcelsDescription
source: Your shipments will appear here.
de: Ihre Sendungen werden hier angezeigt.

# ordersHistoryEmptyFoodTitle
source: No food orders yet
de: Noch keine Essensbestellungen

# ordersHistoryEmptyFoodDescription
source: Your food delivery orders will appear here.
de: Ihre Essenslieferungen werden hier angezeigt.

# ordersServiceRideSemanticLabel
source: Ride order
de: Fahrtbestellung

# ordersServiceParcelSemanticLabel
source: Parcel shipment
de: Paketversand

# ordersServiceFoodSemanticLabel
source: Food order
de: Essensbestellung

# parcelsShipmentsTitle
source: My Shipments
de: Meine Sendungen

# parcelsShipmentsNewShipmentTooltip
source: New shipment
de: Neue Sendung

# parcelsShipmentsEmptyTitle
source: No shipments yet
de: Noch keine Sendungen

# parcelsShipmentsEmptyDescription
source: You don't have any shipments yet. Create your first shipment to start sending parcels.
de: Du hast noch keine Sendungen. Erstelle deine erste Sendung, um zu starten.

# parcelsShipmentsEmptyCta
source: Create first shipment
de: Erste Sendung erstellen

# parcelsShipmentStatusCreated
source: Created
de: Erstellt

# parcelsShipmentStatusInTransit
source: In Transit
de: Unterwegs

# parcelsShipmentStatusDelivered
source: Delivered
de: Zugestellt

# parcelsShipmentStatusCancelled
source: Cancelled
de: Storniert

# parcelsCreateShipmentCta
source: Create shipment
de: Sendung erstellen

# parcelsCreateShipmentSenderSectionTitle
source: Sender details
de: Absender

# parcelsCreateShipmentReceiverSectionTitle
source: Receiver details
de: Empfänger

# parcelsCreateShipmentParcelDetailsSectionTitle
source: Parcel details
de: Paketdetails

# parcelsCreateShipmentSenderNameLabel
source: Sender name
de: Name des Absenders

# parcelsCreateShipmentSenderPhoneLabel
source: Sender phone
de: Telefon des Absenders

# parcelsCreateShipmentReceiverNameLabel
source: Receiver name
de: Name des Empfängers

# parcelsCreateShipmentReceiverPhoneLabel
source: Receiver phone
de: Telefon des Empfängers

# parcelsCreateShipmentPickupAddressLabel
source: Pickup address
de: Abholadresse

# parcelsCreateShipmentDropoffAddressLabel
source: Dropoff address
de: Lieferadresse

# parcelsCreateShipmentWeightLabel
source: Weight (kg)
de: Gewicht (kg)

# parcelsCreateShipmentSizeLabel
source: Size
de: Größe

# parcelsCreateShipmentNotesLabel
source: Notes
de: Notizen

# parcelsCreateShipmentServiceTypeLabel
source: Service type
de: Service-Typ

# parcelsCreateShipmentServiceTypeError
source: Please select a service type
de: Bitte einen Service-Typ auswählen

# parcelsCreateShipmentSuccessMessage
source: Shipment created successfully
de: Sendung erfolgreich erstellt

# commonErrorFieldRequired
source: This field is required
de: Dieses Feld ist erforderlich

# commonAddressesTitle
source: Addresses
de: Adressen

# parcelsShipmentDetailsContactsSectionTitle
source: Contacts
de: Kontakte

# parcelsShipmentDetailsDetailsSectionTitle
source: Parcel details
de: Paketdetails

# parcelsShipmentDetailsServiceTypeLabel
source: Service type
de: Service-Typ

# commonTotalLabel
source: Total
de: Gesamt
