Repository: abdulrhmanasami/DW_workspace
Catalog: lib/l10n/app_*.arb
Languages: ar, de

# adminAnalyticsReports
source: Analytics & Reports
ar: التحليلات والتقارير
de: Analysen & Berichte

# adminAnalyticsAccess
source: You have access to analytics
ar: لديك صلاحية الوصول للتحليلات
de: Sie haben Zugriff auf Analysen

# adminSystemMonitoring
source: System Monitoring
ar: مراقبة النظام
de: Systemüberwachung

# adminRbacStats
source: RBAC Statistics
ar: إحصائيات RBAC
de: RBAC-Statistiken

# adminRbacEnabled
source: Status: {status}
ar: الحالة: {status}

# adminRbacStatusEnabled
source: Enabled
ar: مفعّل
de: Aktiviert

# adminRbacStatusDisabled
source: Disabled
ar: معطّل
de: Deaktiviert

# adminCanaryPercentage
source: Canary percentage: {percentage}%
ar: نسبة الـ Canary: {percentage}%
de: Canary-Prozentsatz: {percentage}%

# adminRolesCount
source: Roles count: {count}
ar: عدد الأدوار: {count}
de: Anzahl der Rollen: {count}

# adminTotalPermissions
source: Total permissions: {count}
ar: إجمالي الصلاحيات: {count}
de: Gesamtberechtigungen: {count}

# trackingCheckingAvailability
source: Checking tracking availability...
ar: جارٍ التحقق من توفر التتبع...
de: Prüfe Verfügbarkeit der Sendungsverfolgung...

# trackingLoadingRoute
source: Loading route...
ar: جارٍ تحميل المسار...
de: Route wird geladen...

# ordersHistoryTitle
source: My Orders
ar: طلباتي
de: Meine Bestellungen

# ordersHistoryEmptyTitle
source: No orders yet
ar: لا توجد طلبات بعد
de: Noch keine Bestellungen

# ordersHistoryEmptySubtitle
source: You don't have any orders yet. Start by creating a new shipment.
ar: لا يوجد لديك أي طلبات حتى الآن. ابدأ بإنشاء شحنة جديدة.
de: Sie haben noch keine Bestellungen. Erstellen Sie zuerst eine neue Sendung.

# ordersHistoryUnavailableTitle
source: Orders Unavailable
ar: الطلبات غير متاحة
de: Bestellungen nicht verfügbar

# ordersHistoryLoadError
source: Unable to load order history
ar: تعذّر تحميل سجل الطلبات
de: Bestellverlauf konnte nicht geladen werden

# ordersFilterAll
source: All
ar: الكل
de: Alle

# ordersFilterParcels
source: Parcels
ar: الطرود
de: Pakete

# ordersFilterRides
source: Rides
ar: الرحلات
de: Fahrten

# ordersSectionRidesTitle
source: Rides
ar: الرحلات
de: Fahrten

# ordersRideItemTitleToDestination
source: Ride to {destination}
ar: رحلة إلى {destination}
de: Fahrt nach {destination}

# ordersRideStatusCompleted
source: Completed
ar: مكتملة
de: Abgeschlossen

# ordersRideStatusCancelled
source: Cancelled
ar: ملغاة
de: Storniert

# ordersRideStatusFailed
source: Failed
ar: فشلت
de: Fehlgeschlagen

# paymentMethodsTitle
source: Payment Methods
ar: وسائل الدفع
de: Zahlungsmethoden

# paymentMethodsEmptyTitle
source: No payment methods
ar: لا توجد وسائل دفع
de: Keine Zahlungsmethoden

# paymentMethodsEmptySubtitle
source: Add a payment method to get started
ar: أضف وسيلة دفع للبدء
de: Fügen Sie eine Zahlungsmethode hinzu, um zu beginnen

# paymentMethodsAddButton
source: Add payment method
ar: إضافة وسيلة دفع
de: Zahlungsmethode hinzufügen

# paymentMethodsLoadError
source: Unable to load payment methods
ar: تعذّر تحميل وسائل الدفع
de: Zahlungsmethoden konnten nicht geladen werden

# paymentMethodsSaving
source: Saving...
ar: جارٍ الحفظ...
de: Wird gespeichert...

# authVerifying
source: Verifying...
ar: جارٍ التحقق...
de: Wird verifiziert...

# authSendingCode
source: Sending code...
ar: جارٍ إرسال الرمز...
de: Code wird gesendet...

# featureUnavailableTitle
source: Feature Unavailable
ar: الميزة غير متاحة
de: Funktion nicht verfügbar

# featureUnavailableGeneric
source: This feature is currently unavailable. Please try again later.
ar: هذه الميزة غير متاحة حالياً. حاول مرة أخرى لاحقاً.
de: Diese Funktion ist derzeit nicht verfügbar. Bitte versuchen Sie es später erneut.

# onbWelcomeTitle
source: Welcome to Delivery Ways
ar: أهلاً بك في ديليفري ويز
de: Willkommen bei Delivery Ways

# onbWelcomeBody
source: Your reliable delivery partner. Order what you need and track your delivery in real-time.
ar: شريكك الموثوق للتوصيل. اطلب ما تحتاجه وتتبع توصيلتك بالوقت الفعلي.
de: Ihr zuverlässiger Lieferpartner. Bestellen Sie, was Sie brauchen, und verfolgen Sie Ihre Lieferung in Echtzeit.

# onbAppIntroTitle
source: How It Works
ar: كيف يعمل
de: So funktioniert's

# onbAppIntroBody
source: Browse products, place your order, and we'll deliver it to your door. Simple and fast.
ar: تصفح المنتجات، قدم طلبك، ونوصله لباب بيتك. بسيط وسريع.
de: Produkte durchsuchen, bestellen und wir liefern an Ihre Tür. Einfach und schnell.

# onbOrderingTitle
source: Easy Ordering
ar: طلب سهل
de: Einfach Bestellen

# onbOrderingBody
source: Find what you need, add to cart, and checkout in seconds. Multiple payment options available where supported.
ar: اعثر على ما تحتاجه، أضفه للسلة، وادفع في ثوانٍ. خيارات دفع متعددة متوفرة حيث يُدعم ذلك.
de: Finden Sie, was Sie brauchen, legen Sie es in den Warenkorb und bezahlen Sie in Sekunden. Mehrere Zahlungsoptionen wo unterstützt.

# onbTrackingTitle
source: Track Your Order
ar: تتبع طلبك
de: Bestellung Verfolgen

# onbTrackingBody
source: Follow your delivery in real-time when tracking is available in your area. You'll see updates at every step.
ar: تابع توصيلتك بالوقت الفعلي عندما يكون التتبع متاحاً في منطقتك. ستتلقى تحديثات في كل خطوة.
de: Verfolgen Sie Ihre Lieferung in Echtzeit, wenn Tracking in Ihrer Region verfügbar ist. Sie erhalten Updates bei jedem Schritt.

# onbSecurityTitle
source: Your Security Matters
ar: أمانك يهمنا
de: Ihre Sicherheit ist wichtig

# onbSecurityBody
source: Your data is protected with industry-standard security. We never share your personal information without consent.
ar: بياناتك محمية بمعايير أمان عالمية. لن نشارك معلوماتك الشخصية أبداً بدون موافقتك.
de: Ihre Daten sind mit branchenüblicher Sicherheit geschützt. Wir geben Ihre persönlichen Daten niemals ohne Zustimmung weiter.

# onbNotificationsTitle
source: Stay Updated
ar: ابق على اطلاع
de: Bleiben Sie informiert

# onbNotificationsBody
source: Enable notifications to receive order updates, delivery alerts, and exclusive offers.
ar: فعّل الإشعارات لتلقي تحديثات الطلبات وتنبيهات التوصيل والعروض الحصرية.
de: Aktivieren Sie Benachrichtigungen, um Bestellupdates, Lieferbenachrichtigungen und exklusive Angebote zu erhalten.

# onbReadyTitle
source: You're All Set!
ar: أنت جاهز!
de: Alles bereit!

# onbReadyBody
source: Start exploring and place your first order. We're here to help whenever you need us.
ar: ابدأ الاستكشاف وقدم طلبك الأول. نحن هنا لمساعدتك متى احتجت.
de: Starten Sie und geben Sie Ihre erste Bestellung auf. Wir sind hier, um Ihnen zu helfen.

# onbRideTitle
source: Get a Ride, Instantly.
ar: احصل على توصيلة فوراً.

# onbRideBody
source: Tap, ride, and arrive. Fast, reliable, and affordable transport at your fingertips.
ar: اضغط، اركب، وصل. نقل سريع وموثوق وبأسعار مناسبة في متناول يدك.

# onbParcelsTitle
source: Deliver Anything, Effortlessly.
ar: وصّل أي شيء بسهولة.

# onbParcelsBody
source: Send packages across town or across the country. Track every step of the journey.
ar: أرسل طرودك عبر المدينة أو عبر البلاد. تتبع كل خطوة في الرحلة.

# onbFoodTitle
source: Your Favorite Food, Delivered.
ar: طعامك المفضل يصلك.

# onbFoodBody
source: Craving something delicious? Order from top restaurants and enjoy fast delivery to your door.
ar: تشتهي شيئاً لذيذاً؟ اطلب من أفضل المطاعم واستمتع بتوصيل سريع لباب بيتك.

# onbRiderWelcomeTitle
source: Welcome, Rider!
ar: أهلاً بك أيها السائق!
de: Willkommen, Fahrer!

# onbRiderWelcomeBody
source: Join our delivery network and start earning. Flexible hours, fair compensation.
ar: انضم لشبكة التوصيل وابدأ بالكسب. ساعات مرنة وأجر عادل.
de: Werden Sie Teil unseres Liefernetzwerks und verdienen Sie. Flexible Arbeitszeiten, faire Vergütung.

# onbRiderHowItWorksTitle
source: Your Journey Starts Here
ar: رحلتك تبدأ هنا
de: Ihre Reise beginnt hier

# onbRiderHowItWorksBody
source: Accept deliveries, navigate to pickup, deliver to customers. Track your earnings in the app.
ar: اقبل التوصيلات، توجه للاستلام، وصّل للعملاء. تتبع أرباحك في التطبيق.
de: Lieferungen annehmen, zur Abholung navigieren, an Kunden liefern. Verfolgen Sie Ihre Einnahmen in der App.

# onbRiderLocationTitle
source: Enable Location
ar: تفعيل الموقع
de: Standort aktivieren

# onbRiderLocationBody
source: We use your location to match you with nearby deliveries and provide navigation. Your location is only shared during active deliveries.
ar: نستخدم موقعك لربطك بالتوصيلات القريبة وتوفير التنقل. يُشارك موقعك فقط أثناء التوصيلات النشطة.
de: Wir verwenden Ihren Standort, um Sie mit Lieferungen in der Nähe zu verbinden. Ihr Standort wird nur während aktiver Lieferungen geteilt.

# onbRiderSecurityTitle
source: Safe & Secure
ar: آمن ومحمي
de: Sicher & Geschützt

# onbRiderSecurityBody
source: Your earnings and personal data are protected. Multi-factor authentication keeps your account safe.
ar: أرباحك وبياناتك الشخصية محمية. المصادقة متعددة العوامل تحافظ على أمان حسابك.
de: Ihre Einnahmen und persönlichen Daten sind geschützt. Multi-Faktor-Authentifizierung hält Ihr Konto sicher.

# onbRiderNotificationsTitle
source: Never Miss a Delivery
ar: لا تفوت أي توصيلة
de: Keine Lieferung verpassen

# onbRiderNotificationsBody
source: Get instant alerts for new delivery requests and important updates.
ar: احصل على تنبيهات فورية لطلبات التوصيل الجديدة والتحديثات المهمة.
de: Erhalten Sie sofortige Benachrichtigungen für neue Lieferanfragen und wichtige Updates.

# onbRiderReadyTitle
source: Ready to Deliver!
ar: جاهز للتوصيل!
de: Bereit zum Liefern!

# onbRiderReadyBody
source: You're set up and ready to go. Start accepting deliveries now.
ar: أنت مُعدّ وجاهز للانطلاق. ابدأ بقبول التوصيلات الآن.
de: Sie sind eingerichtet und startklar. Beginnen Sie jetzt mit der Annahme von Lieferungen.

# onbCtaGetStarted
source: Get Started
ar: ابدأ الآن
de: Los geht's

# onbCtaNext
source: Next
ar: التالي
de: Weiter

# onbCtaSkip
source: Skip
ar: تخطي
de: Überspringen

# onbCtaEnableNotifications
source: Enable Notifications
ar: تفعيل الإشعارات
de: Benachrichtigungen aktivieren

# onbCtaEnableLocation
source: Enable Location
ar: تفعيل الموقع
de: Standort aktivieren

# onbCtaStartOrdering
source: Start Ordering
ar: ابدأ الطلب
de: Jetzt bestellen

# onbCtaStartDelivering
source: Start Delivering
ar: ابدأ التوصيل
de: Jetzt liefern

# onbCtaMaybeLater
source: Maybe Later
ar: ربما لاحقاً
de: Vielleicht später

# onbCtaDone
source: Done
ar: تم
de: Fertig

# onbCtaBack
source: Back
ar: رجوع
de: Zurück

# hintAuthPhoneTitle
source: Secure Sign-In
ar: تسجيل دخول آمن
de: Sichere Anmeldung

# hintAuthPhoneBody
source: We'll send a verification code to this number. Your phone number helps us keep your account secure.
ar: سنرسل رمز تحقق لهذا الرقم. رقم هاتفك يساعدنا على حماية حسابك.
de: Wir senden einen Bestätigungscode an diese Nummer. Ihre Telefonnummer hilft uns, Ihr Konto zu schützen.

# hintAuthOtpTitle
source: Check Your Messages
ar: تحقق من رسائلك
de: Prüfen Sie Ihre Nachrichten

# hintAuthOtpBody
source: Enter the code we sent to your phone. This verifies that it's really you.
ar: أدخل الرمز الذي أرسلناه لهاتفك. هذا يؤكد أنك أنت حقاً.
de: Geben Sie den Code ein, den wir an Ihr Telefon gesendet haben. Dies bestätigt, dass Sie es wirklich sind.

# hintAuth2faTitle
source: Extra Protection
ar: حماية إضافية
de: Zusätzlicher Schutz

# hintAuth2faBody
source: Two-factor authentication adds an extra layer of security to your account.
ar: المصادقة الثنائية تضيف طبقة أمان إضافية لحسابك.
de: Zwei-Faktor-Authentifizierung fügt eine zusätzliche Sicherheitsebene zu Ihrem Konto hinzu.

# hintAuthBiometricTitle
source: Quick Access
ar: دخول سريع
de: Schneller Zugriff

# hintAuthBiometricBody
source: Use your fingerprint or face to sign in faster while keeping your account secure.
ar: استخدم بصمتك أو وجهك لتسجيل الدخول بسرعة مع الحفاظ على أمان حسابك.
de: Verwenden Sie Ihren Fingerabdruck oder Ihr Gesicht, um sich schneller anzumelden und Ihr Konto sicher zu halten.

# hintPaymentsMethodsTitle
source: Payment Options
ar: خيارات الدفع
de: Zahlungsoptionen

# hintPaymentsMethodsBody
source: Add a payment method to speed up checkout. Your payment information is securely encrypted.
ar: أضف طريقة دفع لتسريع عملية الشراء. معلومات الدفع الخاصة بك مشفرة بشكل آمن.
de: Fügen Sie eine Zahlungsmethode hinzu, um den Checkout zu beschleunigen. Ihre Zahlungsinformationen sind sicher verschlüsselt.

# hintPaymentsSecurityTitle
source: Secure Payment
ar: دفع آمن
de: Sichere Zahlung

# hintPaymentsSecurityBody
source: Your card details are encrypted and never stored on our servers. Payments are processed by trusted providers.
ar: تفاصيل بطاقتك مشفرة ولا تُخزن على خوادمنا أبداً. المدفوعات تُعالج من قبل مزودين موثوقين.
de: Ihre Kartendaten werden verschlüsselt und nie auf unseren Servern gespeichert. Zahlungen werden von vertrauenswürdigen Anbietern verarbeitet.

# hintPaymentsLimitedTitle
source: Limited Payment Options
ar: خيارات دفع محدودة
de: Begrenzte Zahlungsoptionen

# hintPaymentsLimitedBody
source: Some payment methods may not be available in your region. Cash on delivery is available where supported.
ar: بعض طرق الدفع قد لا تكون متوفرة في منطقتك. الدفع عند الاستلام متاح حيث يُدعم.
de: Einige Zahlungsmethoden sind möglicherweise nicht in Ihrer Region verfügbar. Nachnahme ist verfügbar, wo unterstützt.

# hintTrackingExplanationTitle
source: Live Tracking
ar: تتبع مباشر

# hintTrackingExplanationBody
source: Watch your order's journey from pickup to delivery on the map.
ar: شاهد رحلة طلبك من الاستلام حتى التوصيل على الخريطة.
de: Beobachten Sie die Reise Ihrer Bestellung von der Abholung bis zur Lieferung auf der Karte.

# hintTrackingUnavailableTitle
source: Tracking Not Available
ar: التتبع غير متاح
de: Tracking nicht verfügbar

# hintTrackingUnavailableBody
source: Real-time tracking is not available for this order. You'll receive status updates via notifications.
ar: التتبع بالوقت الفعلي غير متاح لهذا الطلب. ستتلقى تحديثات الحالة عبر الإشعارات.
de: Echtzeit-Tracking ist für diese Bestellung nicht verfügbar. Sie erhalten Statusaktualisierungen per Benachrichtigung.

# hintTrackingRealtimeTitle
source: Real-Time Updates
ar: تحديثات بالوقت الفعلي
de: Echtzeit-Updates

# hintTrackingRealtimeBody
source: The map updates automatically as your delivery progresses.
ar: الخريطة تُحدّث تلقائياً مع تقدم توصيلتك.
de: Die Karte wird automatisch aktualisiert, während Ihre Lieferung fortschreitet.

# hintNotificationsImportanceTitle
source: Why Notifications Matter
ar: لماذا الإشعارات مهمة
de: Warum Benachrichtigungen wichtig sind

# hintNotificationsImportanceBody
source: Get instant updates about your order status, delivery arrival, and special offers.
ar: احصل على تحديثات فورية حول حالة طلبك ووصول التوصيلة والعروض الخاصة.
de: Erhalten Sie sofortige Updates über Ihren Bestellstatus, die Ankunft der Lieferung und Sonderangebote.

# hintNotificationsPermissionTitle
source: Enable Notifications
ar: تفعيل الإشعارات
de: Benachrichtigungen aktivieren

# hintNotificationsPermissionBody
source: To receive order updates and delivery alerts, please enable notifications.
ar: لتلقي تحديثات الطلبات وتنبيهات التوصيل، يرجى تفعيل الإشعارات.
de: Um Bestellupdates und Lieferbenachrichtigungen zu erhalten, aktivieren Sie bitte Benachrichtigungen.

# hintNotificationsPermissionCta
source: Enable Now
ar: فعّل الآن
de: Jetzt aktivieren

# hintOrdersFirstTitle
source: Your First Order
ar: طلبك الأول
de: Ihre erste Bestellung

# hintOrdersFirstBody
source: Congratulations on your first order! Track its progress here.
ar: تهانينا على طلبك الأول! تتبع تقدمه هنا.
de: Herzlichen Glückwunsch zu Ihrer ersten Bestellung! Verfolgen Sie den Fortschritt hier.

# hintOrdersEmptyTitle
source: No Orders Yet
ar: لا توجد طلبات بعد
de: Noch keine Bestellungen

# hintOrdersEmptyBody
source: Start browsing and place your first order. Your order history will appear here.
ar: ابدأ بالتصفح وقدم طلبك الأول. سيظهر سجل طلباتك هنا.
de: Beginnen Sie zu stöbern und geben Sie Ihre erste Bestellung auf. Ihr Bestellverlauf erscheint hier.

# hintOrdersEmptyCta
source: Browse Now
ar: تصفح الآن
de: Jetzt stöbern

# settingsReplayOnboarding
source: View App Introduction
ar: عرض مقدمة التطبيق
de: App-Einführung anzeigen

# settingsReplayOnboardingDescription
source: See the welcome guide again
ar: شاهد دليل الترحيب مرة أخرى
de: Die Willkommensanleitung erneut ansehen

# rideBookingTitle
source: Book a Ride
ar: اطلب رحلة

# rideBookingMapStubLabel
source: Map preview (stub – Ride Booking)
ar: معاينة خريطة (وضع تجريبي لعرض الرحلة)

# rideBookingSheetTitle
source: Where do you want to go?
ar: إلى أين تريد الذهاب؟

# rideBookingSheetSubtitle
source: Choose your pickup point and destination to see options and pricing.
ar: اختر نقطة الانطلاق والوجهة لعرض الخيارات والتسعير.

# rideBookingPickupLabel
source: Pickup
ar: نقطة الانطلاق

# rideBookingPickupCurrentLocation
source: Current location
ar: موقعك الحالي

# rideBookingDestinationLabel
source: Destination
ar: الوجهة

# rideBookingDestinationHint
source: Where to?
ar: إلى أين؟

# rideBookingRecentTitle
source: Recent places
ar: أماكنك الأخيرة

# rideBookingRecentHome
source: Home
ar: المنزل

# rideBookingRecentHomeSubtitle
source: Saved home address
ar: عنوان المنزل المحفوظ

# rideBookingRecentWork
source: Work
ar: العمل

# rideBookingRecentWorkSubtitle
source: Saved work address
ar: عنوان العمل المحفوظ

# rideBookingRecentAddNew
source: Add new place
ar: إضافة مكان جديد

# rideBookingRecentAddNewSubtitle
source: Save a new frequent destination
ar: احفظ وجهة متكررة جديدة

# rideBookingSeeOptionsCta
source: See options
ar: عرض الخيارات

# rideConfirmTitle
source: Confirm your ride
ar: تأكيد الرحلة
de: Fahrt bestätigen

# rideConfirmMapStubLabel
source: Route preview (stub – the actual map will show your driver and destination).
ar: معاينة المسار (وضع تجريبي – سيتم عرض السائق والوجهة لاحقًا).

# rideConfirmSheetTitle
source: Choose your ride
ar: اختر نوع الرحلة
de: Wähle deine Fahrt

# rideConfirmSheetSubtitle
source: Select a ride option, review pricing, and confirm your trip.
ar: اختر الخيار المناسب، راجع التسعير، ثم أكّد رحلتك.
de: Wähle eine Fahrtoption, prüfe den Preis und bestätige deine Fahrt.

# rideConfirmOptionEconomyTitle
source: Economy
ar: اقتصادي

# rideConfirmOptionEconomySubtitle
source: Affordable everyday rides for up to 4 people.
ar: رحلات يومية ميسورة التكلفة لما يصل إلى ٤ أشخاص.
de: Günstige Alltagsfahrten für bis zu 4 Personen.

# rideConfirmOptionXlSubtitle
source: Extra space for groups and larger items.
ar: مساحة إضافية للمجموعات والأغراض الكبيرة.
de: Extra Platz für Gruppen und größere Gegenstände.

# rideConfirmOptionPremiumTitle
source: Premium
ar: مميزة

# rideConfirmOptionPremiumSubtitle
source: High-comfort rides with top-rated drivers.
ar: رحلات مريحة مع أفضل السائقين تقييمًا.
de: Komfortable Fahrten mit erstklassig bewerteten Fahrern.

# rideConfirmOptionEtaFormat
source: {minutes} min away
ar: {minutes} دقيقة تقريبًا
de: {minutes} Min. entfernt

# rideConfirmOptionPriceApprox
source: ≈ {amount} SAR
ar: ≈ {amount} ريال
de: ≈ {amount} EUR

# rideConfirmPaymentLabel
source: Payment method
ar: طريقة الدفع
de: Zahlungsmethode

# rideConfirmPaymentStubValue
source: Visa •• 4242 (stub)
ar: فيزا •• 4242 (تجريبية)

# rideConfirmPrimaryCta
source: Request Ride
ar: اطلب الرحلة
de: Fahrt anfordern

# rideConfirmRequestedStubMessage
source: Ride request stub – backend integration coming soon.
ar: طلب الرحلة هنا تجريبي – سيتم ربطه بالخلفية لاحقًا.
de: Fahrtanfrage Stub – Backend-Integration folgt.

# profileTitle
source: Profile
ar: الملف الشخصي

# profileSectionSettingsTitle
source: Settings
ar: الإعدادات

# profileSectionPrivacyTitle
source: Privacy & Data
ar: الخصوصية والبيانات

# profileUserFallbackName
source: User
ar: مستخدم

# profileUserPhoneLabel
source: Phone number
ar: رقم الجوال

# profileSettingsPersonalInfoTitle
source: Personal info
ar: المعلومات الشخصية

# profileSettingsPersonalInfoSubtitle
source: Manage your name and details.
ar: إدارة اسمك وبياناتك الأساسية.

# profileSettingsRidePrefsTitle
source: Ride preferences
ar: تفضيلات الرحلات

# profileSettingsRidePrefsSubtitle
source: Coming soon.
ar: قريبًا.

# profileSettingsNotificationsTitle
source: Notifications
ar: الإشعارات

# profileSettingsNotificationsSubtitle
source: Control alerts and offers.
ar: تحكم في التنبيهات والعروض.

# profileSettingsHelpTitle
source: Help & support
ar: المساعدة والدعم

# profileSettingsHelpSubtitle
source: Get help with your trips and orders.
ar: احصل على مساعدة في رحلاتك وطلباتك.

# profilePrivacyExportTitle
source: Export my data
ar: تصدير بياناتي

# profilePrivacyExportSubtitle
source: Request a copy of your personal data.
ar: اطلب نسخة من بياناتك الشخصية.

# profilePrivacyErasureTitle
source: Erase my data
ar: حذف بياناتي

# profilePrivacyErasureSubtitle
source: Request deletion of your personal data.
ar: اطلب حذف بياناتك الشخصية من النظام.

# profileLogoutTitle
source: Logout
ar: تسجيل الخروج

# profileLogoutSubtitle
source: Sign out of your account
ar: تسجيل الخروج من حسابك

# profileLogoutDialogTitle
source: Logout
ar: تأكيد تسجيل الخروج

# profileLogoutDialogBody
source: Are you sure you want to sign out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

# profileLogoutDialogCancel
source: Cancel
ar: إلغاء

# profileLogoutDialogConfirm
source: Logout
ar: تسجيل الخروج

# ridePhaseDraftLabel
source: Draft
ar: مسودة

# ridePhaseQuotingLabel
source: Getting quote…
ar: جارٍ حساب السعر…

# ridePhaseRequestingLabel
source: Requesting…
ar: جارٍ إرسال الطلب…

# ridePhaseFindingDriverLabel
source: Finding driver…
ar: جارٍ البحث عن سائق…

# ridePhaseDriverAcceptedLabel
source: Driver accepted
ar: تم قبول السائق

# ridePhaseDriverArrivedLabel
source: Driver arrived
ar: السائق وصل

# ridePhaseInProgressLabel
source: Trip in progress
ar: الرحلة جارية

# ridePhasePaymentLabel
source: Payment
ar: إتمام الدفع

# ridePhaseCompletedLabel
source: Completed
ar: تم إنهاء الرحلة

# ridePhaseCancelledLabel
source: Cancelled
ar: تم إلغاء الرحلة

# ridePhaseFailedLabel
source: Failed
ar: فشل في الرحلة

# rideErrorOptionsLoadFailed
source: Failed to load ride options. Please try again.
ar: تعذر تحميل خيارات الرحلة. حاول مرة أخرى.

# rideErrorRetryCta
source: Retry
ar: إعادة المحاولة

# rideActiveNoTripTitle
source: No active trip
ar: لا توجد رحلة نشطة

# rideActiveNoTripBody
source: You do not have an active trip right now.
ar: لا توجد لديك رحلة جارية في الوقت الحالي.

# rideActiveAppBarTitle
source: Your trip
ar: رحلتك

# rideActiveEtaFormat
source: ETA ~ {minutes} min
ar: الوقت المتوقع للوصول ~ {minutes} دقيقة

# rideActiveContactDriverCta
source: Contact driver
ar: التواصل مع السائق
de: Fahrer kontaktieren

# rideActiveShareTripCta
source: Share trip status
ar: مشاركة حالة الرحلة
de: Fahrtstatus teilen

# rideActiveCancelTripCta
source: Cancel ride
ar: إلغاء الرحلة
de: Fahrt stornieren

# rideActiveShareTripCopied
source: Trip status copied. You can paste it into any app.
ar: تم نسخ حالة الرحلة. يمكنك لصقها في أي تطبيق.
de: Fahrtstatus kopiert. Du kannst ihn in jeder App einfügen.

# rideActiveContactNoPhoneError
source: Driver contact details are not available yet.
ar: بيانات تواصل السائق غير متوفرة حالياً.
de: Fahrerkontaktdaten sind noch nicht verfügbar.

# rideActiveShareGenericError
source: Unable to prepare trip status right now. Please try again.
ar: لا يمكن تجهيز حالة الرحلة الآن. يرجى المحاولة لاحقاً.
de: Fahrtstatus kann gerade nicht vorbereitet werden. Bitte versuche es erneut.

# rideActiveShareMessageTemplate
source: I'm on a Delivery Ways ride to {destination}. Track my trip status here: {link}
ar: أنا في رحلة مع Delivery Ways إلى {destination}. يمكنك متابعة حالة الرحلة هنا: {link}
de: Ich bin mit Delivery Ways auf dem Weg nach {destination}. Du kannst meinen Fahrtstatus hier verfolgen: {link}

# rideActiveCancelErrorGeneric
source: Could not cancel the ride. Please try again.
ar: تعذر إلغاء الرحلة. يرجى المحاولة مرة أخرى.
